zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_hsp.h
  * @author  MCD Application Team
  * @brief   Header file of HSP HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U3xx_HAL_HSP_H
#define STM32U3xx_HAL_HSP_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal_def.h"

/** @addtogroup STM32U3xx_HAL_Driver
  * @{
  */

#if defined(HSP1)

/** @defgroup HSP HSP
  * @{
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup HSP_Exported_Constants HSP Exported Constants
  * @{
  */

/** @defgroup HSP_Hardware_definition  HSP Hardware definition
  * @{
  */
#define HAL_HSP_INSTANCE_NBR  HSP_INSTANCE_NBR /*!< Constant defined in CMSIS Device file */

/** HSP1 register address for PARAMR0 */
#define HAL_HSP1_PARAMR0_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE))
/** HSP1 register address for PARAMR1 */
#define HAL_HSP1_PARAMR1_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000004UL))
/** HSP1 register address for PARAMR2 */
#define HAL_HSP1_PARAMR2_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000008UL))
/** HSP1 register address for PARAMR3 */
#define HAL_HSP1_PARAMR3_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x000000000CUL))
/** HSP1 register address for PARAMR4 */
#define HAL_HSP1_PARAMR4_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000010UL))
/** HSP1 register address for PARAMR5 */
#define HAL_HSP1_PARAMR5_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000014UL))
/** HSP1 register address for PARAMR6 */
#define HAL_HSP1_PARAMR6_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000018UL))
/** HSP1 register address for PARAMR7 */
#define HAL_HSP1_PARAMR7_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x000000001CUL))
/** HSP1 register address for PARAMR8 */
#define HAL_HSP1_PARAMR8_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000020UL))
/** HSP1 register address for PARAMR9 */
#define HAL_HSP1_PARAMR9_ADDRESS   ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000024UL))
/** HSP1 register address for PARAMR10 */
#define HAL_HSP1_PARAMR10_ADDRESS  ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000028UL))
/** HSP1 register address for PARAMR11 */
#define HAL_HSP1_PARAMR11_ADDRESS  ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x000000002CUL))
/** HSP1 register address for PARAMR12 */
#define HAL_HSP1_PARAMR12_ADDRESS  ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000030UL))
/** HSP1 register address for PARAMR13 */
#define HAL_HSP1_PARAMR13_ADDRESS  ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000034UL))
/** HSP1 register address for PARAMR14 */
#define HAL_HSP1_PARAMR14_ADDRESS  ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x0000000038UL))
/** HSP1 register address for PARAMR15 */
#define HAL_HSP1_PARAMR15_ADDRESS  ((volatile uint32_t *)(HSP1_PARAMR0_BASE + 0x000000003CUL))

/** HSP1 register address for DCMDPTR0 */
#define HAL_HSP1_DCMDPTR0_ADDRESS  ((volatile uint32_t *)(HSP1_DCMDPTR0_BASE))
/** HSP1 register address for DCMDPTR1 */
#define HAL_HSP1_DCMDPTR1_ADDRESS  ((volatile uint32_t *)(HSP1_DCMDPTR0_BASE + 0x0000000004UL))
/** HSP1 register address for DCMDPTR2 */
#define HAL_HSP1_DCMDPTR2_ADDRESS  ((volatile uint32_t *)(HSP1_DCMDPTR0_BASE + 0x0000000008UL))
/** HSP1 register address for DCMDIDR */
#define HAL_HSP1_DCMDIDR_ADDRESS   ((volatile uint32_t *)(HSP1_DCMDIDR_BASE))

/**
  * @}
  */

/** @defgroup HSP_HAL_Error_Codes  HSP HAL Error Codes
  * @{
  */
#define HAL_HSP_ERROR_NONE              (0UL)         /*!< No error                              */
#define HAL_HSP_ERROR_INVALID_PARAM     (1UL << 1U)   /*!< Invalid parameter                     */
#define HAL_HSP_ERROR_INVALID_CALLBACK  (1UL << 2U)   /*!< Invalid Callback ID                   */
#define HAL_HSP_ERROR_BOOT              (1UL << 3U)   /*!< Boot error: code returned in handle   */
#define HAL_HSP_ERROR_FIRMWARE          (1UL << 4U)   /*!< Firmware Error: see @ref HSP_Firmware_Error_Codes */

#define HAL_HSP_ERROR_TRGIN_OVR         (1UL << 10U)  /*!< TRGIN Overrun */
#define HAL_HSP_ERROR_BUFFER_UDR_OR_OVR (1UL << 11U)  /*!< STREAM Buffer Overrun or Underrun */
#define HAL_HSP_ERROR_CAPTURE_OVR       (1UL << 12U)  /*!< TIMESTAMP Capture Overrun         */
#define HAL_HSP_ERROR_SCHEDULER         (1UL << 13U)  /*!< SPE Scheduler Error               */
#define HAL_HSP_ERROR_BREAK_IN          (1UL << 14U)  /*!< Break Input Arrival               */
#define HAL_HSP_ERROR_HDEG_OVR          (1UL << 15U)  /*!< HDEG Overrun                      */
#define HAL_HSP_ERROR_OPCODE_INVALID    (1UL << 16U)  /*!< Firmware Invalid OpCode           */
#define HAL_HSP_ERROR_SPE_ACCESS        (1UL << 17U)  /*!< SPE Access Error                  */
#define HAL_HSP_ERROR_FPU               (1UL << 18U)  /*!< FPU Error                         */

/** HAL HSP All Hardware Errors constant */
#define HAL_HSP_ERROR_HW_ALL  \
  (HAL_HSP_ERROR_TRGIN_OVR   | HAL_HSP_ERROR_BUFFER_UDR_OR_OVR | HAL_HSP_ERROR_CAPTURE_OVR  \
   | HAL_HSP_ERROR_SCHEDULER | HAL_HSP_ERROR_BREAK_IN          | HAL_HSP_ERROR_HDEG_OVR     \
   | HAL_HSP_ERROR_OPCODE_INVALID | HAL_HSP_ERROR_SPE_ACCESS   | HAL_HSP_ERROR_FPU)

/**
  * @}
  */

/** @defgroup HSP_Firmware_Error_Codes  HSP Firmware Error Codes
  * @{
  */
#define HAL_HSP_FW_ERROR_PL_EMPTY      (5U << HSP_CR_BSTAT_Pos) /*!< Firmware tries to run an empty Processing list */
#define HAL_HSP_FW_ERROR_SUPERVISOR    (6U << HSP_CR_BSTAT_Pos) /*!< Bad Supervisor Command */
#define HAL_HSP_FW_ERROR_CROM_VERSION  (9U << HSP_CR_BSTAT_Pos) /*!< CROM ID Error: not in line with CRAM code */

/**
  * @}
  */

