zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
/** @defgroup HSP_Smart_Clocking_Values  HSP Smart Clocking Value
  * @{
  */
#define HAL_HSP_SMARTCLOCKING_CTRL  HSP_CR_CTRLCGDIS /*!< ID for HSP SmartClocking of CTRL block */
#define HAL_HSP_SMARTCLOCKING_SPE   HSP_CR_SPECGDIS  /*!< ID for HSP SmartClocking of SPE block  */
#define HAL_HSP_SMARTCLOCKING_MMC   HSP_CR_MMCCGDIS  /*!< ID for HSP SmartClocking of MMC block  */

/** HAL HSP SmartClocking mask of all blocks */
#define HAL_HSP_SMARTCLOCKING_ALL  (HAL_HSP_SMARTCLOCKING_CTRL | HAL_HSP_SMARTCLOCKING_SPE | HAL_HSP_SMARTCLOCKING_MMC)

/**
  * @}
  */

/** @defgroup HSP_TRGIN_ID  HSP Trigger Input Identifiers
  * @{
  */
#define HAL_HSP_TRGIN_0  HSP_ITFENR_TRGI0EN  /*!< ID of HSP TRGIN interface 0 */
#define HAL_HSP_TRGIN_1  HSP_ITFENR_TRGI1EN  /*!< ID of HSP TRGIN interface 1 */
#define HAL_HSP_TRGIN_2  HSP_ITFENR_TRGI2EN  /*!< ID of HSP TRGIN interface 2 */
#define HAL_HSP_TRGIN_3  HSP_ITFENR_TRGI3EN  /*!< ID of HSP TRGIN interface 3 */
#define HAL_HSP_TRGIN_4  HSP_ITFENR_TRGI4EN  /*!< ID of HSP TRGIN interface 4 */
#define HAL_HSP_TRGIN_5  HSP_ITFENR_TRGI5EN  /*!< ID of HSP TRGIN interface 5 */
#define HAL_HSP_TRGIN_6  HSP_ITFENR_TRGI6EN  /*!< ID of HSP TRGIN interface 6 */
#define HAL_HSP_TRGIN_7  HSP_ITFENR_TRGI7EN  /*!< ID of HSP TRGIN interface 7 */
#define HAL_HSP_TRGIN_8  HSP_ITFENR_TRGI8EN  /*!< ID of HSP TRGIN interface 8 */
#define HAL_HSP_TRGIN_9  HSP_ITFENR_TRGI9EN  /*!< ID of HSP TRGIN interface 9 */

/** HAL HSP TRGIN mask of all interfaces */
#define HAL_HSP_TRGIN_ALL                                                                     \
  (HAL_HSP_TRGIN_0   | HAL_HSP_TRGIN_1 | HAL_HSP_TRGIN_2 | HAL_HSP_TRGIN_3 | HAL_HSP_TRGIN_4  \
   | HAL_HSP_TRGIN_5 | HAL_HSP_TRGIN_6 | HAL_HSP_TRGIN_7 | HAL_HSP_TRGIN_8 | HAL_HSP_TRGIN_9)

/**
  * @}
  */

/** @defgroup HSP_EVENT_Constants HSP Event Constants
  * @{
  */
/** Event Priority bitfield position in enumerate @ref HAL_HSP_EVENT_SourceTypeDef */
#define HAL_HSP_EVENT_PRIO_POS    (26U)

/** Event Priority bitfield mask in enumerate @ref HAL_HSP_EVENT_SourceTypeDef */
#define HAL_HSP_EVENT_PRIO_MSK    (0x1FU << HAL_HSP_EVENT_PRIO_POS)

/** Event Source bitfield position in enumerate @ref HAL_HSP_EVENT_SourceTypeDef */
#define HAL_HSP_EVENT_SOURCE_POS  (0U)

/** Event Source bitfield mask in enumerate @ref HAL_HSP_EVENT_SourceTypeDef */
#define HAL_HSP_EVENT_SOURCE_MSK  (0x7U << HAL_HSP_EVENT_SOURCE_POS)

#define HAL_HSP_EVENT_1   HSP_EVTENR_EVTEN_0  /*!< ID of HSP EVENT 1 */
#define HAL_HSP_EVENT_2   HSP_EVTENR_EVTEN_1  /*!< ID of HSP EVENT 2 */
#define HAL_HSP_EVENT_3   HSP_EVTENR_EVTEN_2  /*!< ID of HSP EVENT 3 */
#define HAL_HSP_EVENT_4   HSP_EVTENR_EVTEN_3  /*!< ID of HSP EVENT 4 */
#define HAL_HSP_EVENT_5   HSP_EVTENR_EVTEN_4  /*!< ID of HSP EVENT 5 */
#define HAL_HSP_EVENT_6   HSP_EVTENR_EVTEN_5  /*!< ID of HSP EVENT 6 */
#define HAL_HSP_EVENT_7   HSP_EVTENR_EVTEN_6  /*!< ID of HSP EVENT 7 */
#define HAL_HSP_EVENT_8   HSP_EVTENR_EVTEN_7  /*!< ID of HSP EVENT 8 */
#define HAL_HSP_EVENT_9   HSP_EVTENR_EVTEN_8  /*!< ID of HSP EVENT 9 */
#define HAL_HSP_EVENT_10  HSP_EVTENR_EVTEN_9  /*!< ID of HSP EVENT 10 */
#define HAL_HSP_EVENT_11  HSP_EVTENR_EVTEN_10 /*!< ID of HSP EVENT 11 */
#define HAL_HSP_EVENT_12  HSP_EVTENR_EVTEN_11 /*!< ID of HSP EVENT 12 */
#define HAL_HSP_EVENT_13  HSP_EVTENR_EVTEN_12 /*!< ID of HSP EVENT 13 */
#define HAL_HSP_EVENT_14  HSP_EVTENR_EVTEN_13 /*!< ID of HSP EVENT 14 */
#define HAL_HSP_EVENT_15  HSP_EVTENR_EVTEN_14 /*!< ID of HSP EVENT 15 */
#define HAL_HSP_EVENT_16  HSP_EVTENR_EVTEN_15 /*!< ID of HSP EVENT 16 */
#define HAL_HSP_EVENT_17  HSP_EVTENR_EVTEN_16 /*!< ID of HSP EVENT 17 */
#define HAL_HSP_EVENT_18  HSP_EVTENR_EVTEN_17 /*!< ID of HSP EVENT 18 */
#define HAL_HSP_EVENT_19  HSP_EVTENR_EVTEN_18 /*!< ID of HSP EVENT 19 */
#define HAL_HSP_EVENT_20  HSP_EVTENR_EVTEN_19 /*!< ID of HSP EVENT 20 */
#define HAL_HSP_EVENT_21  HSP_EVTENR_EVTEN_20 /*!< ID of HSP EVENT 21 */
#define HAL_HSP_EVENT_22  HSP_EVTENR_EVTEN_21 /*!< ID of HSP EVENT 22 */

/** HAL HSP Mask of all HSP Events */
#define HAL_HSP_EVENT_ALL                                                                         \
  (HAL_HSP_EVENT_1    | HAL_HSP_EVENT_2  | HAL_HSP_EVENT_3  | HAL_HSP_EVENT_4  | HAL_HSP_EVENT_5  \
   | HAL_HSP_EVENT_6  | HAL_HSP_EVENT_7  | HAL_HSP_EVENT_8  | HAL_HSP_EVENT_9  | HAL_HSP_EVENT_10 \
   | HAL_HSP_EVENT_11 | HAL_HSP_EVENT_12 | HAL_HSP_EVENT_13 | HAL_HSP_EVENT_14 | HAL_HSP_EVENT_15 \
   | HAL_HSP_EVENT_16 | HAL_HSP_EVENT_17 | HAL_HSP_EVENT_18 | HAL_HSP_EVENT_19 | HAL_HSP_EVENT_20 \
   | HAL_HSP_EVENT_21 | HAL_HSP_EVENT_22)

/**
  * @}
  */

/** @defgroup HSP_STREAM_BUFFER_Flags HSP STREAM Buffer Flags
  * @{
  */
#define HAL_HSP_FLAG_EVT_STREAM_BUFFER_0     HSP_EVT_ISR_B0EVTF  /*!< STREAM Buffer 0 TX Full / RX Empty flag */
#define HAL_HSP_FLAG_EVT_STREAM_BUFFER_1     HSP_EVT_ISR_B1EVTF  /*!< STREAM Buffer 1 TX Full / RX Empty flag */
#define HAL_HSP_FLAG_EVT_STREAM_BUFFER_2     HSP_EVT_ISR_B2EVTF  /*!< STREAM Buffer 2 TX Full / RX Empty flag */
#define HAL_HSP_FLAG_EVT_STREAM_BUFFER_3     HSP_EVT_ISR_B3EVTF  /*!< STREAM Buffer 3 TX Full / RX Empty flag */
#define HAL_HSP_FLAG_EVT_STREAM_BUFFER_ALL                               \
  (HAL_HSP_FLAG_EVT_STREAM_BUFFER_0  | HAL_HSP_FLAG_EVT_STREAM_BUFFER_1  \
   | HAL_HSP_FLAG_EVT_STREAM_BUFFER_2 | HAL_HSP_FLAG_EVT_STREAM_BUFFER_3)  /*!< All STREAM Buffer Ready flags  */

#define HAL_HSP_FLAG_ERR_STREAM_BUFFER_0     HSP_ERR_ISR_B0ERRF  /*!< STREAM Buffer 0 TX UDR / RX OVR flag */
#define HAL_HSP_FLAG_ERR_STREAM_BUFFER_1     HSP_ERR_ISR_B1ERRF  /*!< STREAM Buffer 1 TX UDR / RX OVR flag */
#define HAL_HSP_FLAG_ERR_STREAM_BUFFER_2     HSP_ERR_ISR_B2ERRF  /*!< STREAM Buffer 2 TX UDR / RX OVR flag */
#define HAL_HSP_FLAG_ERR_STREAM_BUFFER_3     HSP_ERR_ISR_B3ERRF  /*!< STREAM Buffer 3 TX UDR / RX OVR flag */
#define HAL_HSP_FLAG_ERR_STREAM_BUFFER_ALL                               \
  (HAL_HSP_FLAG_ERR_STREAM_BUFFER_0  | HAL_HSP_FLAG_ERR_STREAM_BUFFER_1  \
   | HAL_HSP_FLAG_ERR_STREAM_BUFFER_2 | HAL_HSP_FLAG_ERR_STREAM_BUFFER_3)  /*!< All STREAM TX UDR / RX OVR flags */

/**
  * @}
  */

/** @defgroup HSP_TRGIN_Flags HSP TRGIN Flags
  * @{
  */
#define HAL_HSP_FLAG_ERR_TRGIN_OVR     HSP_ERR_ISR_TRGIOVRF  /*!< TRGIN Error Overrun flag */

/**
  * @}
  */

/** @defgroup HSP_Task_Comparator_Flags HSP Task Comparator Flags
  * @{
  */
#define HAL_HSP_FLAG_EVT_TCU_OVERLAP              (HSP_EVT_ISR_TOVLPF)   /*!< Task Overlap flag          */
#define HAL_HSP_FLAG_EVT_TCU_COMP0_START_OF_TASK  (HSP_EVT_ISR_SOTECP0F) /*!< Task Started flag of TCU 0 */
#define HAL_HSP_FLAG_EVT_TCU_COMP1_START_OF_TASK  (HSP_EVT_ISR_SOTECP1F) /*!< Task Started flag of TCU 1 */
#define HAL_HSP_FLAG_EVT_TCU_COMP2_START_OF_TASK  (HSP_EVT_ISR_SOTECP2F) /*!< Task Started flag of TCU 2 */
#define HAL_HSP_FLAG_EVT_TCU_COMP3_START_OF_TASK  (HSP_EVT_ISR_SOTECP3F) /*!< Task Started flag of TCU 3 */
#define HAL_HSP_FLAG_EVT_TCU_COMP0_END_OF_TASK    (HSP_EVT_ISR_SOTECP0F) /*!< Task Ended flag of TCU 0   */
#define HAL_HSP_FLAG_EVT_TCU_COMP1_END_OF_TASK    (HSP_EVT_ISR_SOTECP1F) /*!< Task Ended flag of TCU 1   */
#define HAL_HSP_FLAG_EVT_TCU_COMP2_END_OF_TASK    (HSP_EVT_ISR_SOTECP2F) /*!< Task Ended flag of TCU 2   */
#define HAL_HSP_FLAG_EVT_TCU_COMP3_END_OF_TASK    (HSP_EVT_ISR_SOTECP3F) /*!< Task Ended flag of TCU 3   */

/** All TCU flags */
#define HAL_HSP_FLAG_EVT_TCU_ALL                                                        \
  (HAL_HSP_FLAG_EVT_TCU_OVERLAP                                                         \
   | HAL_HSP_FLAG_EVT_TCU_COMP0_START_OF_TASK | HAL_HSP_FLAG_EVT_TCU_COMP0_END_OF_TASK  \
   | HAL_HSP_FLAG_EVT_TCU_COMP1_START_OF_TASK | HAL_HSP_FLAG_EVT_TCU_COMP1_END_OF_TASK  \
   | HAL_HSP_FLAG_EVT_TCU_COMP2_START_OF_TASK | HAL_HSP_FLAG_EVT_TCU_COMP2_END_OF_TASK  \
   | HAL_HSP_FLAG_EVT_TCU_COMP3_START_OF_TASK | HAL_HSP_FLAG_EVT_TCU_COMP3_END_OF_TASK)

/**
  * @}
  */

/** @defgroup HSP_SPE_Flags HSP SPE Flags
  * @{
  */
#define HAL_HSP_FLAG_EVT_SPE_ENTER_IN_WFE   (HSP_EVT_ISR_SOFWFEF)  /*!< Enter In WFE flag    */
#define HAL_HSP_FLAG_EVT_SPE_EXIT_FROM_WFE  (HSP_EVT_ISR_EOFWFEF)  /*!< Exit  From WFE flag  */

/**
  * @}
  */

/** @defgroup HSP_Interrupts_Constants HSP Interrupts Constants
  * @{
  */
#define HAL_HSP_IT_NONE                    (0UL)                  /*!< No interrupts */

/**
  * @}
  */

