zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
/** @defgroup HSP_Interrupts_Error_Constants HSP Interrupts Error Constants
  * @{
  */
#define HAL_HSP_IT_ERR_TRGIN_OVR           HSP_ERR_IER_TRGIOVRIE  /*!< Trigger Input Overrun error interrupt */
#define HAL_HSP_IT_ERR_STREAM0_OVR         HSP_ERR_IER_B0ERRIE    /*!< Stream 0 Underrun/Overrun error interrupt */
#define HAL_HSP_IT_ERR_STREAM1_OVR         HSP_ERR_IER_B1ERRIE    /*!< Stream 1 Underrun/Overrun error interrupt */
#define HAL_HSP_IT_ERR_STREAM2_OVR         HSP_ERR_IER_B2ERRIE    /*!< Stream 2 Underrun/Overrun error interrupt */
#define HAL_HSP_IT_ERR_STREAM3_OVR         HSP_ERR_IER_B3ERRIE    /*!< Stream 3 Underrun/Overrun error interrupt */
#define HAL_HSP_IT_ERR_TSC_OVR             HSP_ERR_IER_CAPOVRIE   /*!< Timestamp Capture Overrun error interrupt */
#define HAL_HSP_IT_ERR_SPE_FW              HSP_ERR_IER_FWERRIE    /*!< SPE Firmware error interrupt */
#define HAL_HSP_IT_ERR_SPE_SCHEDULER       HSP_ERR_IER_SCHERRIE   /*!< SPE Scheduler error interrupt */
#define HAL_HSP_IT_ERR_SPE_BREAK           HSP_ERR_IER_BKINIE     /*!< SPE Break interrupt */
#define HAL_HSP_IT_ERR_SPE_HDEG_OVR        HSP_ERR_IER_HDEGOVRIE  /*!< SPE HDEG Overrun error interrupt */
#define HAL_HSP_IT_ERR_SPE_INVALID_OPCODE  HSP_ERR_IER_OPCOERRIE  /*!< SPE Invalid Opcode error interrupt */
#define HAL_HSP_IT_ERR_SPE_ACCESS          HSP_ERR_IER_ACCERRIE   /*!< SPE Access error interrupt */
#define HAL_HSP_IT_ERR_SPE_FPU_UDF         HSP_ERR_IER_UDFIE      /*!< SPE FPU Underflow error interrupt */
#define HAL_HSP_IT_ERR_SPE_FPU_OVF         HSP_ERR_IER_OVFIE      /*!< SPE FPU Overflow error interrupt */
#define HAL_HSP_IT_ERR_SPE_FPU_DBZ         HSP_ERR_IER_DBZIE      /*!< SPE FPU Division By Zero error interrupt */
#define HAL_HSP_IT_ERR_SPE_FPU_INVALID     HSP_ERR_IER_INVIE      /*!< SPE FPU Invalid Exception error interrupt */
#define HAL_HSP_IT_ERR_SPE_FPU_DENORMAL    HSP_ERR_IER_DENORMIE   /*!< SPE FPU Denormal error interrupt */

/** HAL HSP Mask of all STREAM Buffer Errors */
#define HAL_HSP_IT_ERR_STREAM_ALL  (HAL_HSP_IT_ERR_STREAM0_OVR   | HAL_HSP_IT_ERR_STREAM1_OVR  \
                                    | HAL_HSP_IT_ERR_STREAM2_OVR | HAL_HSP_IT_ERR_STREAM3_OVR)

/** HAL HSP Mask of all TRGIN Errors */
#define HAL_HSP_IT_ERR_TRGIN_ALL  (HAL_HSP_IT_ERR_TRGIN_OVR)

/** HAL HSP Mask of all Timestamp Capture Errors */
#define HAL_HSP_IT_ERR_TSC_ALL  (HAL_HSP_IT_ERR_TSC_OVR)

/** HAL HSP Mask of all FPU Errors */
#define HAL_HSP_IT_ERR_SPE_FPU_ALL  (HAL_HSP_IT_ERR_SPE_FPU_OVF       | HAL_HSP_IT_ERR_SPE_FPU_DBZ        \
                                     | HAL_HSP_IT_ERR_SPE_FPU_INVALID | HAL_HSP_IT_ERR_SPE_FPU_DENORMAL)

/** HAL HSP Mask of all SPE Errors */
#define HAL_HSP_IT_ERR_SPE_ALL  (HAL_HSP_IT_ERR_SPE_FW            | HAL_HSP_IT_ERR_SPE_SCHEDULER       \
                                 | HAL_HSP_IT_ERR_SPE_HDEG_OVR    | HAL_HSP_IT_ERR_SPE_INVALID_OPCODE  \
                                 | HAL_HSP_IT_ERR_SPE_ACCESS      | HAL_HSP_IT_ERR_SPE_FPU_UDF         \
                                 | HAL_HSP_IT_ERR_SPE_FPU_OVF     | HAL_HSP_IT_ERR_SPE_FPU_DBZ         \
                                 | HAL_HSP_IT_ERR_SPE_FPU_INVALID | HAL_HSP_IT_ERR_SPE_FPU_DENORMAL    \
                                 | HAL_HSP_IT_ERR_SPE_BREAK)


/** HAL HSP Mask of all HSP Errors */
#define HAL_HSP_IT_ERR_ALL (HAL_HSP_IT_ERR_STREAM_ALL | HAL_HSP_IT_ERR_TRGIN_ALL  \
                            | HAL_HSP_IT_ERR_TSC_ALL  | HAL_HSP_IT_ERR_SPE_ALL)

#define HAL_HSP_FLAG_ERR_SPE_FPU              (HSP_ERR_ISR_FPUERRF)   /*!< Task Overlap flag          */

/**
  * @}
  */

/** @defgroup HSP_Error_Information_Constants HSP Errors Information Constants
  * @{
  */
#define HAL_HSP_ERRINF_SPE_SLAVE_AHB_ACCESS     HSP_ERRINFR_SAHBERR    /*!< SPE Slave AHB Access error    */
#define HAL_HSP_ERRINF_SPE_INTERNAL_AHB_ACCESS  HSP_ERRINFR_MAHBERR    /*!< SPE Internal AHB Access error */
#define HAL_HSP_ERRINF_SPE_DATA_MEM_ACCESS      HSP_ERRINFR_DMERR      /*!< SPE Data Memory Access error  */
#define HAL_HSP_ERRINF_SPE_CODE_MEM_ACCESS      HSP_ERRINFR_CMERR      /*!< SPE Code Memory Access error  */

/** HAL HSP Mask of all HSP SPE Access Errors */
#define HAL_HSP_ERRINF_SPE_ALL  (HAL_HSP_ERRINF_SPE_SLAVE_AHB_ACCESS   | HAL_HSP_ERRINF_SPE_INTERNAL_AHB_ACCESS  \
                                 | HAL_HSP_ERRINF_SPE_DATA_MEM_ACCESS  | HAL_HSP_ERRINF_SPE_CODE_MEM_ACCESS)

#define HAL_HSP_ERRINF_FPU_INEXACT              HSP_ERRINFR_INEXACT    /*!< FPU Inexact Exception         */
#define HAL_HSP_ERRINF_FPU_UDF                  HSP_ERRINFR_UDFLOW     /*!< FPU Underflow error           */
#define HAL_HSP_ERRINF_FPU_OVF                  HSP_ERRINFR_OVFLOW     /*!< FPU Overflow error            */
#define HAL_HSP_ERRINF_FPU_DIVZERO              HSP_ERRINFR_DIVZERO    /*!< FPU Division By Zero error    */
#define HAL_HSP_ERRINF_FPU_INVALID              HSP_ERRINFR_INVALID    /*!< FPU Invalid Exception error   */
#define HAL_HSP_ERRINF_FPU_DENORMAL             HSP_ERRINFR_DENORM     /*!< FPU Denormal error            */

/** HAL HSP Mask of all HSP FPU Errors */
#define HAL_HSP_ERRINF_FPU_ALL  (HAL_HSP_ERRINF_FPU_INEXACT   | HAL_HSP_ERRINF_FPU_UDF      \
                                 | HAL_HSP_ERRINF_FPU_OVF     | HAL_HSP_ERRINF_FPU_DIVZERO  \
                                 | HAL_HSP_ERRINF_FPU_INVALID | HAL_HSP_ERRINF_FPU_DENORMAL)

/**
  * @}
  */

/** @defgroup HSP_Event_Interrupts_Constants HSP Event Interrupts Constants
  * @{
  */
#define HAL_HSP_IT_EVT_CMD_DIRECT_COMMAND_DONE HSP_EVT_IER_DCDONEIE   /*!< Direct Command Done event interrupt */
#define HAL_HSP_IT_EVT_CMD_CDEG_READY          HSP_EVT_IER_CDEGRDYIE  /*!< CDEG Ready event interrupt */
#define HAL_HSP_IT_EVT_TSC_DATA_READY          HSP_EVT_IER_CAPRDYIE   /*!< TimeStamp Capture Data Ready event interrupt */
#define HAL_HSP_IT_EVT_SPE_ENTER_IN_WFE        HSP_EVT_IER_SOFWFEIE   /*!< SPE Enter In WFE mode event interrupt */
#define HAL_HSP_IT_EVT_SPE_EXIT_FROM_WFE       HSP_EVT_IER_EOFWFEIE   /*!< SPE Exit From WFE mode event interrupt */
#define HAL_HSP_IT_EVT_SPE_FPU_SATURATION      HSP_EVT_IER_FPUSATIE   /*!< SPE FPU Saturation event interrupt */
#define HAL_HSP_IT_EVT_STREAM0_READY           HSP_EVT_IER_B0EVTIE    /*!< Stream buffer 0 is empty or filled (depend of STREAM direction) */
#define HAL_HSP_IT_EVT_STREAM1_READY           HSP_EVT_IER_B1EVTIE    /*!< Stream buffer 1 is empty or filled (depend of STREAM direction) */
#define HAL_HSP_IT_EVT_STREAM2_READY           HSP_EVT_IER_B2EVTIE    /*!< Stream buffer 2 is empty or filled (depend of STREAM direction) */
#define HAL_HSP_IT_EVT_STREAM3_READY           HSP_EVT_IER_B3EVTIE    /*!< Stream buffer 3 is empty or filled (depend of STREAM direction) */
#define HAL_HSP_IT_EVT_TCU0_TASK_STARTED       HSP_EVT_IER_SOTECP0IE  /*!< Task Comparator Unit 0 Start of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU1_TASK_STARTED       HSP_EVT_IER_SOTECP1IE  /*!< Task Comparator Unit 1 Start of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU2_TASK_STARTED       HSP_EVT_IER_SOTECP2IE  /*!< Task Comparator Unit 2 Start of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU3_TASK_STARTED       HSP_EVT_IER_SOTECP3IE  /*!< Task Comparator Unit 3 Start of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU0_TASK_ENDED         HSP_EVT_IER_EOTECP0IE  /*!< Task Comparator Unit 0 End of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU1_TASK_ENDED         HSP_EVT_IER_EOTECP1IE  /*!< Task Comparator Unit 1 End of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU2_TASK_ENDED         HSP_EVT_IER_EOTECP2IE  /*!< Task Comparator Unit 2 End of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU3_TASK_ENDED         HSP_EVT_IER_EOTECP3IE  /*!< Task Comparator Unit 3 End of Task event interrupt */
#define HAL_HSP_IT_EVT_TCU_TASK_OVL            HSP_EVT_IER_TOVLPIE    /*!< Task Comparator Unit Task Overlap event interrupt */

/** HAL HSP Mask of all HSP STREAM Buffer Events */
#define HAL_HSP_IT_EVT_STREAM_ALL  (HAL_HSP_IT_EVT_STREAM0_READY   | HAL_HSP_IT_EVT_STREAM1_READY   \
                                    | HAL_HSP_IT_EVT_STREAM2_READY | HAL_HSP_IT_EVT_STREAM3_READY)

/** HAL HSP Mask of all HSP TCU Events */
#define HAL_HSP_IT_EVT_TCU0_ALL  (HAL_HSP_IT_EVT_TCU0_TASK_STARTED | HAL_HSP_IT_EVT_TCU0_TASK_ENDED)
#define HAL_HSP_IT_EVT_TCU1_ALL  (HAL_HSP_IT_EVT_TCU1_TASK_STARTED | HAL_HSP_IT_EVT_TCU1_TASK_ENDED)
#define HAL_HSP_IT_EVT_TCU2_ALL  (HAL_HSP_IT_EVT_TCU2_TASK_STARTED | HAL_HSP_IT_EVT_TCU2_TASK_ENDED)
#define HAL_HSP_IT_EVT_TCU3_ALL  (HAL_HSP_IT_EVT_TCU3_TASK_STARTED | HAL_HSP_IT_EVT_TCU3_TASK_ENDED)

