zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
#define HAL_HSP_IT_EVT_TCU_ALL  (HAL_HSP_IT_EVT_TCU0_ALL   | HAL_HSP_IT_EVT_TCU1_ALL  \
                                 | HAL_HSP_IT_EVT_TCU2_ALL | HAL_HSP_IT_EVT_TCU3_ALL  \
                                 | HAL_HSP_IT_EVT_TCU_TASK_OVL)

/** HAL HSP Mask of all HSP SPE Events */
#define HAL_HSP_IT_EVT_SPE_ALL  (HAL_HSP_IT_EVT_SPE_ENTER_IN_WFE | HAL_HSP_IT_EVT_SPE_EXIT_FROM_WFE  \
                                 | HAL_HSP_IT_EVT_SPE_FPU_SATURATION)

/**
  * @}
  */

/** @defgroup HSP_Processing_Function_Event_Constants HSP Processing Function Event Constants
  * @{
  */
#define HAL_HSP_PROCLIST_EVT_0  HSP_PFCTEVT_ISR_PFCTF_0   /*!< Processing Function Event 0  flag */
#define HAL_HSP_PROCLIST_EVT_1  HSP_PFCTEVT_ISR_PFCTF_1   /*!< Processing Function Event 1  flag */
#define HAL_HSP_PROCLIST_EVT_2  HSP_PFCTEVT_ISR_PFCTF_2   /*!< Processing Function Event 2  flag */
#define HAL_HSP_PROCLIST_EVT_3  HSP_PFCTEVT_ISR_PFCTF_3   /*!< Processing Function Event 3  flag */
#define HAL_HSP_PROCLIST_EVT_4  HSP_PFCTEVT_ISR_PFCTF_4   /*!< Processing Function Event 4  flag */
#define HAL_HSP_PROCLIST_EVT_5  HSP_PFCTEVT_ISR_PFCTF_5   /*!< Processing Function Event 5  flag */
#define HAL_HSP_PROCLIST_EVT_6  HSP_PFCTEVT_ISR_PFCTF_6   /*!< Processing Function Event 6  flag */
#define HAL_HSP_PROCLIST_EVT_7  HSP_PFCTEVT_ISR_PFCTF_7   /*!< Processing Function Event 7  flag */
#define HAL_HSP_PROCLIST_EVT_8  HSP_PFCTEVT_ISR_PFCTF_8   /*!< Processing Function Event 8  flag */
#define HAL_HSP_PROCLIST_EVT_9  HSP_PFCTEVT_ISR_PFCTF_9   /*!< Processing Function Event 9  flag */
#define HAL_HSP_PROCLIST_EVT_10 HSP_PFCTEVT_ISR_PFCTF_10  /*!< Processing Function Event 10 flag */
#define HAL_HSP_PROCLIST_EVT_11 HSP_PFCTEVT_ISR_PFCTF_11  /*!< Processing Function Event 11 flag */
#define HAL_HSP_PROCLIST_EVT_12 HSP_PFCTEVT_ISR_PFCTF_12  /*!< Processing Function Event 12 flag */
#define HAL_HSP_PROCLIST_EVT_13 HSP_PFCTEVT_ISR_PFCTF_13  /*!< Processing Function Event 13 flag */
#define HAL_HSP_PROCLIST_EVT_14 HSP_PFCTEVT_ISR_PFCTF_14  /*!< Processing Function Event 14 flag */
#define HAL_HSP_PROCLIST_EVT_15 HSP_PFCTEVT_ISR_PFCTF_15  /*!< Processing Function Event 15 flag */
#define HAL_HSP_PROCLIST_EVT_16 HSP_PFCTEVT_ISR_PFCTF_16  /*!< Processing Function Event 16 flag */
#define HAL_HSP_PROCLIST_EVT_17 HSP_PFCTEVT_ISR_PFCTF_17  /*!< Processing Function Event 17 flag */
#define HAL_HSP_PROCLIST_EVT_18 HSP_PFCTEVT_ISR_PFCTF_18  /*!< Processing Function Event 18 flag */
#define HAL_HSP_PROCLIST_EVT_19 HSP_PFCTEVT_ISR_PFCTF_19  /*!< Processing Function Event 19 flag */
#define HAL_HSP_PROCLIST_EVT_20 HSP_PFCTEVT_ISR_PFCTF_20  /*!< Processing Function Event 20 flag */
#define HAL_HSP_PROCLIST_EVT_21 HSP_PFCTEVT_ISR_PFCTF_21  /*!< Processing Function Event 21 flag */
#define HAL_HSP_PROCLIST_EVT_22 HSP_PFCTEVT_ISR_PFCTF_22  /*!< Processing Function Event 22 flag */
#define HAL_HSP_PROCLIST_EVT_23 HSP_PFCTEVT_ISR_PFCTF_23  /*!< Processing Function Event 23 flag */
#define HAL_HSP_PROCLIST_EVT_24 HSP_PFCTEVT_ISR_PFCTF_24  /*!< Processing Function Event 24 flag */
#define HAL_HSP_PROCLIST_EVT_25 HSP_PFCTEVT_ISR_PFCTF_25  /*!< Processing Function Event 25 flag */
#define HAL_HSP_PROCLIST_EVT_26 HSP_PFCTEVT_ISR_PFCTF_26  /*!< Processing Function Event 26 flag */
#define HAL_HSP_PROCLIST_EVT_27 HSP_PFCTEVT_ISR_PFCTF_27  /*!< Processing Function Event 27 flag */
#define HAL_HSP_PROCLIST_EVT_28 HSP_PFCTEVT_ISR_PFCTF_28  /*!< Processing Function Event 28 flag */
#define HAL_HSP_PROCLIST_EVT_29 HSP_PFCTEVT_ISR_PFCTF_29  /*!< Processing Function Event 29 flag */
#define HAL_HSP_PROCLIST_EVT_30 HSP_PFCTEVT_ISR_PFCTF_30  /*!< Processing Function Event 30 flag */
#define HAL_HSP_PROCLIST_EVT_31 HSP_PFCTEVT_ISR_PFCTF_31  /*!< Processing Function Event 31 flag */

/** HAL HSP Mask of all HSP Processing Function Events */
#define HAL_HSP_PROCLIST_EVT_ALL  \
  (HAL_HSP_PROCLIST_EVT_0    | HAL_HSP_PROCLIST_EVT_1  | HAL_HSP_PROCLIST_EVT_2  | HAL_HSP_PROCLIST_EVT_3   \
   | HAL_HSP_PROCLIST_EVT_4  | HAL_HSP_PROCLIST_EVT_5  | HAL_HSP_PROCLIST_EVT_6  | HAL_HSP_PROCLIST_EVT_7   \
   | HAL_HSP_PROCLIST_EVT_8  | HAL_HSP_PROCLIST_EVT_9  | HAL_HSP_PROCLIST_EVT_10 | HAL_HSP_PROCLIST_EVT_11  \
   | HAL_HSP_PROCLIST_EVT_12 | HAL_HSP_PROCLIST_EVT_13 | HAL_HSP_PROCLIST_EVT_14 | HAL_HSP_PROCLIST_EVT_15  \
   | HAL_HSP_PROCLIST_EVT_16 | HAL_HSP_PROCLIST_EVT_17 | HAL_HSP_PROCLIST_EVT_18 | HAL_HSP_PROCLIST_EVT_19  \
   | HAL_HSP_PROCLIST_EVT_20 | HAL_HSP_PROCLIST_EVT_21 | HAL_HSP_PROCLIST_EVT_22 | HAL_HSP_PROCLIST_EVT_23  \
   | HAL_HSP_PROCLIST_EVT_24 | HAL_HSP_PROCLIST_EVT_25 | HAL_HSP_PROCLIST_EVT_26 | HAL_HSP_PROCLIST_EVT_27  \
   | HAL_HSP_PROCLIST_EVT_28 | HAL_HSP_PROCLIST_EVT_29 | HAL_HSP_PROCLIST_EVT_30 | HAL_HSP_PROCLIST_EVT_31)

/**
  * @}
  */

/** @defgroup HSP_Processing_Function_Event_Interrupts_Constants HSP Processing Function Event Interrupts Constants
  * @{
  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_0  HSP_PFCTEVT_IER_PFCTIE_0   /*!< Processing Function Event 0 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_1  HSP_PFCTEVT_IER_PFCTIE_1   /*!< Processing Function Event 1 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_2  HSP_PFCTEVT_IER_PFCTIE_2   /*!< Processing Function Event 2 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_3  HSP_PFCTEVT_IER_PFCTIE_3   /*!< Processing Function Event 3 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_4  HSP_PFCTEVT_IER_PFCTIE_4   /*!< Processing Function Event 4 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_5  HSP_PFCTEVT_IER_PFCTIE_5   /*!< Processing Function Event 5 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_6  HSP_PFCTEVT_IER_PFCTIE_6   /*!< Processing Function Event 6 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_7  HSP_PFCTEVT_IER_PFCTIE_7   /*!< Processing Function Event 7 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_8  HSP_PFCTEVT_IER_PFCTIE_8   /*!< Processing Function Event 8 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_9  HSP_PFCTEVT_IER_PFCTIE_9   /*!< Processing Function Event 9 interrupt  */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_10 HSP_PFCTEVT_IER_PFCTIE_10  /*!< Processing Function Event 10 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_11 HSP_PFCTEVT_IER_PFCTIE_11  /*!< Processing Function Event 11 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_12 HSP_PFCTEVT_IER_PFCTIE_12  /*!< Processing Function Event 12 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_13 HSP_PFCTEVT_IER_PFCTIE_13  /*!< Processing Function Event 13 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_14 HSP_PFCTEVT_IER_PFCTIE_14  /*!< Processing Function Event 14 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_15 HSP_PFCTEVT_IER_PFCTIE_15  /*!< Processing Function Event 15 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_16 HSP_PFCTEVT_IER_PFCTIE_16  /*!< Processing Function Event 16 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_17 HSP_PFCTEVT_IER_PFCTIE_17  /*!< Processing Function Event 17 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_18 HSP_PFCTEVT_IER_PFCTIE_18  /*!< Processing Function Event 18 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_19 HSP_PFCTEVT_IER_PFCTIE_19  /*!< Processing Function Event 19 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_20 HSP_PFCTEVT_IER_PFCTIE_20  /*!< Processing Function Event 20 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_21 HSP_PFCTEVT_IER_PFCTIE_21  /*!< Processing Function Event 21 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_22 HSP_PFCTEVT_IER_PFCTIE_22  /*!< Processing Function Event 22 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_23 HSP_PFCTEVT_IER_PFCTIE_23  /*!< Processing Function Event 23 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_24 HSP_PFCTEVT_IER_PFCTIE_24  /*!< Processing Function Event 24 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_25 HSP_PFCTEVT_IER_PFCTIE_25  /*!< Processing Function Event 25 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_26 HSP_PFCTEVT_IER_PFCTIE_26  /*!< Processing Function Event 26 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_27 HSP_PFCTEVT_IER_PFCTIE_27  /*!< Processing Function Event 27 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_28 HSP_PFCTEVT_IER_PFCTIE_28  /*!< Processing Function Event 28 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_29 HSP_PFCTEVT_IER_PFCTIE_29  /*!< Processing Function Event 29 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_30 HSP_PFCTEVT_IER_PFCTIE_30  /*!< Processing Function Event 30 interrupt */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_31 HSP_PFCTEVT_IER_PFCTIE_31  /*!< Processing Function Event 31 interrupt */

/** HAL HSP Mask of all HSP Processing Function interrupts */
#define HAL_HSP_PROCLIST_IT_PFCTEVT_ALL  \
  (HAL_HSP_PROCLIST_IT_PFCTEVT_0    | HAL_HSP_PROCLIST_IT_PFCTEVT_1  | HAL_HSP_PROCLIST_IT_PFCTEVT_2   \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_3  | HAL_HSP_PROCLIST_IT_PFCTEVT_4  | HAL_HSP_PROCLIST_IT_PFCTEVT_5   \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_6  | HAL_HSP_PROCLIST_IT_PFCTEVT_7  | HAL_HSP_PROCLIST_IT_PFCTEVT_8   \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_9  | HAL_HSP_PROCLIST_IT_PFCTEVT_10 | HAL_HSP_PROCLIST_IT_PFCTEVT_11  \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_12 | HAL_HSP_PROCLIST_IT_PFCTEVT_13 | HAL_HSP_PROCLIST_IT_PFCTEVT_14  \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_15 | HAL_HSP_PROCLIST_IT_PFCTEVT_16 | HAL_HSP_PROCLIST_IT_PFCTEVT_17  \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_18 | HAL_HSP_PROCLIST_IT_PFCTEVT_19 | HAL_HSP_PROCLIST_IT_PFCTEVT_20  \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_21 | HAL_HSP_PROCLIST_IT_PFCTEVT_22 | HAL_HSP_PROCLIST_IT_PFCTEVT_23  \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_24 | HAL_HSP_PROCLIST_IT_PFCTEVT_25 | HAL_HSP_PROCLIST_IT_PFCTEVT_26  \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_27 | HAL_HSP_PROCLIST_IT_PFCTEVT_28 | HAL_HSP_PROCLIST_IT_PFCTEVT_29  \
   | HAL_HSP_PROCLIST_IT_PFCTEVT_30 | HAL_HSP_PROCLIST_IT_PFCTEVT_31)

/**
  * @}
  */

/** @defgroup HSP_SPE_Run_State_Constants HSP SPE Run State Constants
  * @{
  */
#define HAL_HSP_SPE_RUN_STATE_WFE     0U  /*!< HSP SPE Wait For Event state */
#define HAL_HSP_SPE_RUN_STATE_ACTIVE  1U  /*!< HSP SPE Active state         */

/**
  * @}
  */

/** @defgroup HSP_SNOOP_Constants HSP SNOOP Constants
  * @{
  */
/** HAL HSP SNOOP Group Definition */
#define HAL_HSP_SNOOP_GROUP_A    HSP_SNPR_SNPSELA
#define HAL_HSP_SNOOP_GROUP_B    HSP_SNPR_SNPSELB
#define HAL_HSP_SNOOP_GROUP_ALL  (HAL_HSP_SNOOP_GROUP_A | HAL_HSP_SNOOP_GROUP_B)

/** HAL HSP SNOOP Signal Definition */
#define HAL_HSP_SNOOP_GRPA_TASK_2_1_0               (HSP_SNPR_SNPSELA_0 << HSP_SNPR_SNPSELA_Pos)
#define HAL_HSP_SNOOP_GRPA_DMA_CH_2_1_0_IT          (HSP_SNPR_SNPSELA_1 << HSP_SNPR_SNPSELA_Pos)
#define HAL_HSP_SNOOP_GRPA_TRGIN_BUFF_ADC           ((HSP_SNPR_SNPSELA_1 | HSP_SNPR_SNPSELA_0) << HSP_SNPR_SNPSELA_Pos)
#define HAL_HSP_SNOOP_GRPA_TSC_PFCTNB_2_1_0         (HSP_SNPR_SNPSELA_2 << HSP_SNPR_SNPSELA_Pos)
#define HAL_HSP_SNOOP_GRPA_TSC_CMP_2_1_0            ((HSP_SNPR_SNPSELA_2 | HSP_SNPR_SNPSELA_0) << HSP_SNPR_SNPSELA_Pos)
#define HAL_HSP_SNOOP_GRPA_EVTCWKUP_SPEJUMP_SPEWFE  ((HSP_SNPR_SNPSELA_2 | HSP_SNPR_SNPSELA_1) << HSP_SNPR_SNPSELA_Pos)
#define HAL_HSP_SNOOP_GRPA_PE_2_1_0  ((HSP_SNPR_SNPSELA_2 |\
                                       HSP_SNPR_SNPSELA_1 | HSP_SNPR_SNPSELA_0) << HSP_SNPR_SNPSELA_Pos)
#define HAL_HSP_SNOOP_GRPB_TASK_5_4_3               (HSP_SNPR_SNPSELB_0 << HSP_SNPR_SNPSELB_Pos)
#define HAL_HSP_SNOOP_GRPB_PRC_25_24_23             (HSP_SNPR_SNPSELB_1 << HSP_SNPR_SNPSELB_Pos)
#define HAL_HSP_SNOOP_GRPB_DCMD_CDEG_HDEG           ((HSP_SNPR_SNPSELB_1 | HSP_SNPR_SNPSELB_0) << HSP_SNPR_SNPSELB_Pos)
#define HAL_HSP_SNOOP_GRPB_TSC_PFCTNB_5_4_3         (HSP_SNPR_SNPSELB_2 << HSP_SNPR_SNPSELB_Pos)
#define HAL_HSP_SNOOP_GRPB_TSC_CMP_3                ((HSP_SNPR_SNPSELB_2 | HSP_SNPR_SNPSELB_0) << HSP_SNPR_SNPSELB_Pos)
#define HAL_HSP_SNOOP_GRPB_TSC_PULSE_CALL_IF_IFTRUE ((HSP_SNPR_SNPSELB_2 | HSP_SNPR_SNPSELB_1) << HSP_SNPR_SNPSELB_Pos)
#define HAL_HSP_SNOOP_GRPB_PE_5_4_3  ((HSP_SNPR_SNPSELB_2 |\
                                       HSP_SNPR_SNPSELB_1 | HSP_SNPR_SNPSELB_0) << HSP_SNPR_SNPSELB_Pos)

/**
  * @}
  */

/** @defgroup HSP_Break_Event_Constants HSP Break Event constants
  * @{
  */
#define HAL_HSP_BREAK_CRITICAL_EVENT_MEMORY_ACCESS  HSP_BKOCFGR_ACCEREN   /*!< SPE Memory Access Error      */
#define HAL_HSP_BREAK_CRITICAL_EVENT_FPU            HSP_BKOCFGR_FPUEREN   /*!< FPU Error (Div By Zero...)   */
#define HAL_HSP_BREAK_CRITICAL_EVENT_OPCODE         HSP_BKOCFGR_OPCEREN   /*!< OpCode Error                 */
#define HAL_HSP_BREAK_CRITICAL_EVENT_PFCT28         HSP_BKOCFGR_PFCT28EN  /*!< Processing Function Event 28 */
#define HAL_HSP_BREAK_CRITICAL_EVENT_PFCT29         HSP_BKOCFGR_PFCT29EN  /*!< Processing Function Event 29 */
#define HAL_HSP_BREAK_CRITICAL_EVENT_PFCT30         HSP_BKOCFGR_PFCT30EN  /*!< Processing Function Event 30 */
#define HAL_HSP_BREAK_CRITICAL_EVENT_PFCT31         HSP_BKOCFGR_PFCT31EN  /*!< Processing Function Event 31 */
#define HAL_HSP_BREAK_CRITICAL_EVENT_FIRMWARE       HSP_BKOCFGR_FWEREN    /*!< Firmware Error               */
#define HAL_HSP_BREAK_CRITICAL_EVENT_SPE_OVR        HSP_BKOCFGR_HDEGOVEN  /*!< HDEG Overrun                 */

/** HAL HSP BREAK Mask of all Critical Events */
#define HAL_HSP_BREAK_CRITICAL_EVENT_ALL                                               \
  (HAL_HSP_BREAK_CRITICAL_EVENT_MEMORY_ACCESS | HAL_HSP_BREAK_CRITICAL_EVENT_FPU       \
   | HAL_HSP_BREAK_CRITICAL_EVENT_OPCODE      | HAL_HSP_BREAK_CRITICAL_EVENT_PFCT28    \
   | HAL_HSP_BREAK_CRITICAL_EVENT_PFCT29      | HAL_HSP_BREAK_CRITICAL_EVENT_PFCT30    \
   | HAL_HSP_BREAK_CRITICAL_EVENT_PFCT31      | HAL_HSP_BREAK_CRITICAL_EVENT_FIRMWARE  \
   | HAL_HSP_BREAK_CRITICAL_EVENT_SPE_OVR     | HAL_HSP_BREAK_CRITICAL_EVENT_SPE_OVR)

