zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
#define HAL_HSP_BREAK_FREEZE_EVENT_MEMORY_ACCESS   HSP_BKICFGR_ACCEREN   /*!< SPE Memory Access Error      */
#define HAL_HSP_BREAK_FREEZE_EVENT_FPU             HSP_BKICFGR_FPUEREN   /*!< FPU Error (Div By Zero...)   */
#define HAL_HSP_BREAK_FREEZE_EVENT_OPCODE          HSP_BKICFGR_OPCEREN   /*!< OpCode Error                 */
#define HAL_HSP_BREAK_FREEZE_EVENT_PFCT28          HSP_BKICFGR_PFCT28EN  /*!< Processing Function Event 28 */
#define HAL_HSP_BREAK_FREEZE_EVENT_PFCT29          HSP_BKICFGR_PFCT29EN  /*!< Processing Function Event 29 */
#define HAL_HSP_BREAK_FREEZE_EVENT_PFCT30          HSP_BKICFGR_PFCT30EN  /*!< Processing Function Event 30 */
#define HAL_HSP_BREAK_FREEZE_EVENT_PFCT31          HSP_BKICFGR_PFCT31EN  /*!< Processing Function Event 31 */
#define HAL_HSP_BREAK_FREEZE_EVENT_FIRMWARE        HSP_BKICFGR_FWEREN    /*!< Firmware Error               */
#define HAL_HSP_BREAK_FREEZE_EVENT_SPE_OVR         HSP_BKICFGR_HDEGOVEN  /*!< HDEG Overrun                 */
#define HAL_HSP_BREAK_FREEZE_EVENT_FPU_SATURATION  HSP_BKICFGR_FSATEN    /*!< FPU Saturation Event         */

/** HAL HSP BREAK Mask of all Freeze Events */
#define HAL_HSP_BREAK_FREEZE_EVENT_ALL                                                    \
  (HAL_HSP_BREAK_FREEZE_EVENT_MEMORY_ACCESS    | HAL_HSP_BREAK_FREEZE_EVENT_FPU           \
   | HAL_HSP_BREAK_FREEZE_EVENT_OPCODE         | HAL_HSP_BREAK_FREEZE_EVENT_PFCT28        \
   | HAL_HSP_BREAK_FREEZE_EVENT_PFCT29         | HAL_HSP_BREAK_FREEZE_EVENT_PFCT30        \
   | HAL_HSP_BREAK_FREEZE_EVENT_PFCT31         | HAL_HSP_BREAK_FREEZE_EVENT_FIRMWARE      \
   | HAL_HSP_BREAK_FREEZE_EVENT_SPE_OVR        | HAL_HSP_BREAK_FREEZE_EVENT_FPU_SATURATION)

/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup HSP_Exported_Macros  HSP Exported Macros
  * @{
  */
#define STM32_READ_BIT      READ_BIT
#define STM32_SET_BIT       SET_BIT
#define STM32_CLEAR_BIT     CLEAR_BIT
#define STM32_IS_BIT_SET    HAL_IS_BIT_SET
#define STM32_READ_REG      READ_REG
#define STM32_WRITE_REG     WRITE_REG
#define STM32_MODIFY_REG    MODIFY_REG
#define STM32_POSITION_VAL  POSITION_VAL

#define HAL_HSP_GET_INSTANCE(hsp_id)  (((hsp_id) == 0U)?HSP1:NULL)
#define HAL_HSP_GET_INSTANCE_ID(instance)  (((instance) == (uint32_t)HSP1)?0U:HAL_HSP_INSTANCE_UNKNOWN)

/**
  * @ Brief Macros to retrieve HSP Interface definitions
  */
#define HAL_HSP_ADC_INTERFACE_NBR(instance)  0U
#define HAL_HSP_STREAM_INTERFACE_NBR(instance)  HSP_STREAM_INTERFACE_NBR((instance))
#define HAL_HSP_TRIGGER_INTERFACE_NBR(instance)  HSP_TRIGGER_INTERFACE_NBR((instance))
#define HAL_HSP_TASK_COMPARATOR_UNIT_NBR(instance)  HSP_TASK_COMPARATOR_UNIT_NBR((instance))

/**
  * @ Brief Macros to retrieve HSP Interface definitions
  */
/**
  * @brief Get the HSP Event HSEG Source Enum value.
  * @param  evt_priority  Event priority.
  * @retval uint32_t.
  */
#define HAL_HSP_EVENT_SOURCE_GET_ENUM_FOR_HSEG(evt_priority)  \
  ((evt_priority == 1U)?HAL_HSP_EVENT_1_HSEG:                 \
   (evt_priority == 2U)?HAL_HSP_EVENT_2_HSEG:                 \
   (evt_priority == 3U)?HAL_HSP_EVENT_3_HSEG:                 \
   (evt_priority == 4U)?HAL_HSP_EVENT_4_HSEG:                 \
   (evt_priority == 5U)?HAL_HSP_EVENT_5_HSEG:                 \
   (evt_priority == 6U)?HAL_HSP_EVENT_6_HSEG:                 \
   (evt_priority == 7U)?HAL_HSP_EVENT_7_HSEG:                 \
   (evt_priority == 8U)?HAL_HSP_EVENT_8_HSEG:                 \
   (evt_priority == 9U)?HAL_HSP_EVENT_9_HSEG:                 \
   (evt_priority == 10U)?HAL_HSP_EVENT_10_HSEG:               \
   (evt_priority == 11U)?HAL_HSP_EVENT_11_HSEG:               \
   (evt_priority == 12U)?HAL_HSP_EVENT_12_HSEG:               \
   (evt_priority == 13U)?HAL_HSP_EVENT_13_HSEG:               \
   (evt_priority == 14U)?HAL_HSP_EVENT_14_HSEG:               \
   (evt_priority == 15U)?HAL_HSP_EVENT_15_HSEG:               \
   (evt_priority == 16U)?HAL_HSP_EVENT_16_HSEG:               \
   (evt_priority == 17U)?HAL_HSP_EVENT_17_HSEG:               \
   (evt_priority == 18U)?HAL_HSP_EVENT_18_HSEG:               \
   (evt_priority == 19U)?HAL_HSP_EVENT_19_HSEG:               \
   (evt_priority == 20U)?HAL_HSP_EVENT_20_HSEG:               \
   (evt_priority == 21U)?HAL_HSP_EVENT_21_HSEG:               \
   (evt_priority == 22U)?HAL_HSP_EVENT_22_HSEG:               \
   HAL_HSP_EVENT_RESERVED)

/**
  * @brief Get the HSP Event CSEG Source Enum value.
  * @param  evt_priority  Event priority.
  * @retval uint32_t.
  */
#define HAL_HSP_EVENT_SOURCE_GET_ENUM_FOR_CSEG(evt_priority)  \
  ((evt_priority == 1U)?HAL_HSP_EVENT_1_CSEG:                 \
   (evt_priority == 2U)?HAL_HSP_EVENT_2_CSEG:                 \
   (evt_priority == 3U)?HAL_HSP_EVENT_3_CSEG:                 \
   (evt_priority == 4U)?HAL_HSP_EVENT_4_CSEG:                 \
   (evt_priority == 5U)?HAL_HSP_EVENT_5_CSEG:                 \
   (evt_priority == 6U)?HAL_HSP_EVENT_6_CSEG:                 \
   (evt_priority == 7U)?HAL_HSP_EVENT_7_CSEG:                 \
   (evt_priority == 8U)?HAL_HSP_EVENT_8_CSEG:                 \
   (evt_priority == 9U)?HAL_HSP_EVENT_9_CSEG:                 \
   (evt_priority == 10U)?HAL_HSP_EVENT_10_CSEG:               \
   (evt_priority == 11U)?HAL_HSP_EVENT_11_CSEG:               \
   (evt_priority == 12U)?HAL_HSP_EVENT_12_CSEG:               \
   (evt_priority == 13U)?HAL_HSP_EVENT_13_CSEG:               \
   (evt_priority == 14U)?HAL_HSP_EVENT_14_CSEG:               \
   (evt_priority == 15U)?HAL_HSP_EVENT_15_CSEG:               \
   (evt_priority == 16U)?HAL_HSP_EVENT_16_CSEG:               \
   (evt_priority == 17U)?HAL_HSP_EVENT_17_CSEG:               \
   (evt_priority == 18U)?HAL_HSP_EVENT_18_CSEG:               \
   (evt_priority == 19U)?HAL_HSP_EVENT_19_CSEG:               \
   (evt_priority == 20U)?HAL_HSP_EVENT_20_CSEG:               \
   (evt_priority == 21U)?HAL_HSP_EVENT_21_CSEG:               \
   (evt_priority == 22U)?HAL_HSP_EVENT_22_CSEG:               \
   HAL_HSP_EVENT_RESERVED)

/**
  * @brief Get the HSP Event STREAM Buffer Source Enum value.
  * @param  evt_priority  Event priority.
  * @retval uint32_t.
  */
#define HAL_HSP_EVENT_SOURCE_GET_ENUM_FOR_STREAM(evt_priority)  \
  ((evt_priority == 1U)?HAL_HSP_EVENT_1_STREAM0:                \
   (evt_priority == 2U)?HAL_HSP_EVENT_2_STREAM1:                \
   (evt_priority == 3U)?HAL_HSP_EVENT_3_STREAM2:                \
   (evt_priority == 4U)?HAL_HSP_EVENT_4_STREAM3:                \
   (evt_priority == 5U)?HAL_HSP_EVENT_5_STREAM0:                \
   (evt_priority == 6U)?HAL_HSP_EVENT_6_STREAM1:                \
   (evt_priority == 7U)?HAL_HSP_EVENT_7_STREAM2:                \
   (evt_priority == 8U)?HAL_HSP_EVENT_8_STREAM3:                \
   (evt_priority == 9U)?HAL_HSP_EVENT_9_STREAM0:                \
   (evt_priority == 10U)?HAL_HSP_EVENT_10_STREAM1:              \
   (evt_priority == 11U)?HAL_HSP_EVENT_11_STREAM2:              \
   (evt_priority == 12U)?HAL_HSP_EVENT_12_STREAM3:              \
   (evt_priority == 13U)?HAL_HSP_EVENT_13_STREAM0:              \
   (evt_priority == 14U)?HAL_HSP_EVENT_14_STREAM1:              \
   (evt_priority == 15U)?HAL_HSP_EVENT_15_STREAM2:              \
   (evt_priority == 16U)?HAL_HSP_EVENT_16_STREAM3:              \
   (evt_priority == 17U)?HAL_HSP_EVENT_17_STREAM0:              \
   (evt_priority == 18U)?HAL_HSP_EVENT_18_STREAM1:              \
   (evt_priority == 19U)?HAL_HSP_EVENT_19_STREAM2:              \
   (evt_priority == 20U)?HAL_HSP_EVENT_20_STREAM3:              \
   (evt_priority == 21U)?HAL_HSP_EVENT_21_STREAM0:              \
   (evt_priority == 22U)?HAL_HSP_EVENT_22_STREAM1:              \
   HAL_HSP_EVENT_RESERVED)

/**
  * @brief Get the HSP Event TRGIN Source Enum value.
  * @param  evt_priority  Event priority.
  * @param  trig_itf_id   TRGIN id.
  * @retval uint32_t.
  */
#define HAL_HSP_EVENT_SOURCE_GET_ENUM_FOR_TRIGGER(evt_priority, trig_itf_id)  \
  (((evt_priority == 1U)  && (trig_itf_id == 3U))?HAL_HSP_EVENT_1_TRGIN3:     \
   ((evt_priority == 1U)  && (trig_itf_id == 8U))?HAL_HSP_EVENT_1_TRGIN8:     \
   ((evt_priority == 2U)  && (trig_itf_id == 4U))?HAL_HSP_EVENT_2_TRGIN4:     \
   ((evt_priority == 2U)  && (trig_itf_id == 9U))?HAL_HSP_EVENT_2_TRGIN9:     \
   ((evt_priority == 3U)  && (trig_itf_id == 0U))?HAL_HSP_EVENT_3_TRGIN0:     \
   ((evt_priority == 3U)  && (trig_itf_id == 5U))?HAL_HSP_EVENT_3_TRGIN5:     \
   ((evt_priority == 4U)  && (trig_itf_id == 1U))?HAL_HSP_EVENT_4_TRGIN1:     \
   ((evt_priority == 4U)  && (trig_itf_id == 6U))?HAL_HSP_EVENT_4_TRGIN6:     \
   ((evt_priority == 5U)  && (trig_itf_id == 2U))?HAL_HSP_EVENT_5_TRGIN2:     \
   ((evt_priority == 5U)  && (trig_itf_id == 7U))?HAL_HSP_EVENT_5_TRGIN7:     \
   ((evt_priority == 6U)  && (trig_itf_id == 3U))?HAL_HSP_EVENT_6_TRGIN3:     \
   ((evt_priority == 6U)  && (trig_itf_id == 8U))?HAL_HSP_EVENT_6_TRGIN8:     \
   ((evt_priority == 7U)  && (trig_itf_id == 4U))?HAL_HSP_EVENT_7_TRGIN4:     \
   ((evt_priority == 7U)  && (trig_itf_id == 9U))?HAL_HSP_EVENT_7_TRGIN9:     \
   ((evt_priority == 8U)  && (trig_itf_id == 0U))?HAL_HSP_EVENT_8_TRGIN0:     \
   ((evt_priority == 8U)  && (trig_itf_id == 5U))?HAL_HSP_EVENT_8_TRGIN5:     \
   ((evt_priority == 9U)  && (trig_itf_id == 1U))?HAL_HSP_EVENT_9_TRGIN1:     \
   ((evt_priority == 9U)  && (trig_itf_id == 6U))?HAL_HSP_EVENT_9_TRGIN6:     \
   ((evt_priority == 10U) && (trig_itf_id == 2U))?HAL_HSP_EVENT_10_TRGIN2:    \
   ((evt_priority == 10U) && (trig_itf_id == 7U))?HAL_HSP_EVENT_10_TRGIN7:    \
   ((evt_priority == 11U) && (trig_itf_id == 3U))?HAL_HSP_EVENT_11_TRGIN3:    \
   ((evt_priority == 11U) && (trig_itf_id == 8U))?HAL_HSP_EVENT_11_TRGIN8:    \
   ((evt_priority == 12U) && (trig_itf_id == 4U))?HAL_HSP_EVENT_12_TRGIN4:    \
   ((evt_priority == 12U) && (trig_itf_id == 9U))?HAL_HSP_EVENT_12_TRGIN9:    \
   ((evt_priority == 13U) && (trig_itf_id == 0U))?HAL_HSP_EVENT_13_TRGIN0:    \
   ((evt_priority == 13U) && (trig_itf_id == 5U))?HAL_HSP_EVENT_13_TRGIN5:    \
   ((evt_priority == 14U) && (trig_itf_id == 1U))?HAL_HSP_EVENT_14_TRGIN1:    \
   ((evt_priority == 14U) && (trig_itf_id == 6U))?HAL_HSP_EVENT_14_TRGIN6:    \
   ((evt_priority == 15U) && (trig_itf_id == 2U))?HAL_HSP_EVENT_15_TRGIN2:    \
   ((evt_priority == 15U) && (trig_itf_id == 7U))?HAL_HSP_EVENT_15_TRGIN7:    \
   ((evt_priority == 16U) && (trig_itf_id == 3U))?HAL_HSP_EVENT_16_TRGIN3:    \
   ((evt_priority == 16U) && (trig_itf_id == 8U))?HAL_HSP_EVENT_16_TRGIN8:    \
   ((evt_priority == 17U) && (trig_itf_id == 4U))?HAL_HSP_EVENT_17_TRGIN4:    \
   ((evt_priority == 17U) && (trig_itf_id == 9U))?HAL_HSP_EVENT_17_TRGIN9:    \
   ((evt_priority == 18U) && (trig_itf_id == 0U))?HAL_HSP_EVENT_18_TRGIN0:    \
   ((evt_priority == 18U) && (trig_itf_id == 5U))?HAL_HSP_EVENT_18_TRGIN5:    \
   ((evt_priority == 19U) && (trig_itf_id == 1U))?HAL_HSP_EVENT_19_TRGIN1:    \
   ((evt_priority == 19U) && (trig_itf_id == 6U))?HAL_HSP_EVENT_19_TRGIN6:    \
   ((evt_priority == 20U) && (trig_itf_id == 2U))?HAL_HSP_EVENT_20_TRGIN2:    \
   ((evt_priority == 20U) && (trig_itf_id == 7U))?HAL_HSP_EVENT_20_TRGIN7:    \
   ((evt_priority == 21U) && (trig_itf_id == 3U))?HAL_HSP_EVENT_21_TRGIN3:    \
   ((evt_priority == 21U) && (trig_itf_id == 8U))?HAL_HSP_EVENT_21_TRGIN8:    \
   ((evt_priority == 22U) && (trig_itf_id == 4U))?HAL_HSP_EVENT_22_TRGIN4:    \
   ((evt_priority == 22U) && (trig_itf_id == 9U))?HAL_HSP_EVENT_22_TRGIN9:    \
   HAL_HSP_EVENT_RESERVED)

/** @brief Reset HSP handle state.
  * @param  __HANDLE__  specifies the HSP Handle.
  * @retval None
  */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
#define __HAL_HSP_RESET_HANDLE_STATE(__HANDLE__)             \
  do {                                                       \
    (__HANDLE__)->global_state = HAL_HSP_STATE_RESET;        \
    (__HANDLE__)->MspInitCallback = NULL;                    \
    (__HANDLE__)->MspDeInitCallback = NULL;                  \
    (__HANDLE__)->EVT_SPE_RunStateCallback = NULL;           \
    (__HANDLE__)->EVT_SPE_TaskCpltCallback = NULL;    \
    (__HANDLE__)->EVT_SPE_DirectCommandCpltCallback = NULL;  \
    (__HANDLE__)->EVT_SPE_FPUSaturationCallback = NULL;      \
    (__HANDLE__)->EVT_TSC_TimestampReadyCallback = NULL;     \
    (__HANDLE__)->EVT_TCU_TaskStartedCallback = NULL;        \
    (__HANDLE__)->EVT_TCU_TaskEndedCallback = NULL;          \
    (__HANDLE__)->EVT_TCU_TaskOverlapCallback = NULL;        \
    (__HANDLE__)->EVT_STREAM_BufferEmptyCallback = NULL;     \
    (__HANDLE__)->EVT_STREAM_BufferFullCallback = NULL;      \
    (__HANDLE__)->FWEVT_ProcessingEventCallback = NULL;      \
    (__HANDLE__)->ErrorCallback = NULL;                      \
  } while (0U)
#else
#define __HAL_HSP_RESET_HANDLE_STATE(__HANDLE__)  ((__HANDLE__)->global_state = HAL_HSP_STATE_RESET)
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup HSP_Exported_Types  HSP Exported Types
  * @{
  */
/** @defgroup HSP_Exported_Types_Group1 HSP Boot Types
  * @{
  */
/** HAL HSP Performance Monitor State Definition  */
typedef enum
{
  HAL_HSP_PERF_MONITOR_DISABLE = 0U,
  HAL_HSP_PERF_MONITOR_ENABLE  = 1U,
} HAL_HSP_PERF_MONITOR_StateTypeDef;

