zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
/** HAL HSP Boot Configuration structure */
typedef struct
{
  /** Boot Command ID depends on Firmware ROM */
  uint32_t boot_cmd_id;

  /** Boot Success Code depends on Firmware ROM */
  uint32_t boot_success_code;

  /** Enable/Disable the Performance Monitor at Boot step */
  HAL_HSP_PERF_MONITOR_StateTypeDef perf_mon;

  /** Offset of Performance Counter in DRAM */
  uint32_t perf_counter_offset;
} HAL_HSP_Boot_ConfigTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group2 HSP Command Enumerations
  * @{
  */
/** HAL HSP Direct Command Parameter ID Definition */
typedef enum
{
  HAL_HSP_PARAM_0  = 0U,
  HAL_HSP_PARAM_1  = 1U,
  HAL_HSP_PARAM_2  = 2U,
  HAL_HSP_PARAM_3  = 3U,
  HAL_HSP_PARAM_4  = 4U,
  HAL_HSP_PARAM_5  = 5U,
  HAL_HSP_PARAM_6  = 6U,
  HAL_HSP_PARAM_7  = 7U,
  HAL_HSP_PARAM_8  = 8U,
  HAL_HSP_PARAM_9  = 9U,
  HAL_HSP_PARAM_10 = 10U,
  HAL_HSP_PARAM_11 = 11U,
  HAL_HSP_PARAM_12 = 12U,
  HAL_HSP_PARAM_13 = 13U,
  HAL_HSP_PARAM_14 = 14U,
  HAL_HSP_PARAM_15 = 15U,
} HAL_HSP_PARAMTypeDef;

/** Enumerate for Direct Command Data Pointer */
typedef enum
{
  /** Direct Command Pointer 0 */
  HAL_HSP_DIRECT_CMD_PTR0 = 0U,

  /** Direct Command Pointer 1 */
  HAL_HSP_DIRECT_CMD_PTR1 = 1U,

  /** Direct Command Pointer 2 */
  HAL_HSP_DIRECT_CMD_PTR2 = 2U
} HAL_HSP_DIRECT_CMD_Data_PtrTypeDef;

/** Enumerate for Direct Command Status */
typedef enum
{
  /** Direct Command Interface is ready to used */
  HAL_HSP_DIRECT_CMD_READY = 0U,

  /** Direct Command Interface is busy */
  HAL_HSP_DIRECT_CMD_BUSY  = HSP_DCMDSR_DCBSY
} HAL_HSP_DIRECT_CMD_StatusTypeDef;

/** Enumerate for MSGBOX Status */
typedef enum
{
  /** No message in the mailbox */
  HAL_HSP_MSGBOX_SEMAPHORE_NO_MSG        = 0U,

  /** A message is available in the mailbox */
  HAL_HSP_MSGBOX_SEMAPHORE_MSG_AVAILABLE = HSP_H2CSEMR_H2CSEM
} HAL_HSP_MSGBOX_Semaphore_StatusTypeDef;

/** HAL HSP Task ID Definition */
typedef enum
{
  HAL_HSP_TASK_0 = 0U,
  HAL_HSP_TASK_1 = 1U,
  HAL_HSP_TASK_2 = 2U,
  HAL_HSP_TASK_3 = 3U,
  HAL_HSP_TASK_4 = 4U,
  HAL_HSP_TASK_5 = 5U,
  HAL_HSP_TASK_6 = 6U,
  HAL_HSP_TASK_7 = 7U,
  HAL_HSP_TASK_8 = 8U,
  HAL_HSP_TASK_9 = 9U,
  HAL_HSP_TASK_10 = 10U,
  HAL_HSP_TASK_11 = 11U,
  HAL_HSP_TASK_12 = 12U,
  HAL_HSP_TASK_13 = 13U,
  HAL_HSP_TASK_14 = 14U,
  HAL_HSP_TASK_15 = 15U,
  HAL_HSP_TASK_16 = 16U,
  HAL_HSP_TASK_17 = 17U,
  HAL_HSP_TASK_18 = 18U,
  HAL_HSP_TASK_19 = 19U,
  HAL_HSP_TASK_20 = 20U,
  HAL_HSP_TASK_21 = 21U,
  HAL_HSP_TASK_22 = 22U,
  HAL_HSP_TASK_23 = 23U,
  HAL_HSP_TASK_24 = 24U,
  HAL_HSP_TASK_25 = 25U,
  HAL_HSP_TASK_26 = 26U,
  HAL_HSP_TASK_27 = 27U,
  HAL_HSP_TASK_28 = 28U,
  HAL_HSP_TASK_29 = 29U,
  HAL_HSP_TASK_30 = 30U,
  HAL_HSP_TASK_31 = 31U,
  HAL_HSP_TASK_32 = 32U,
  HAL_HSP_TASK_33 = 33U,
  HAL_HSP_TASK_34 = 34U,
  HAL_HSP_TASK_35 = 35U,
  HAL_HSP_TASK_36 = 36U,
  HAL_HSP_TASK_SUPERVISOR = 37U  /*!< Supervisor > */
} HAL_HSP_TaskTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group3 HSP Task Comparator Enumerations
  * @{
  */
/** HAL HSP Task Comparator Unit Definition */
typedef enum
{
  HAL_HSP_TASK_COMPARATOR_0    = 0U,
  HAL_HSP_TASK_COMPARATOR_1    = 1U,
  HAL_HSP_TASK_COMPARATOR_2    = 2U,
  HAL_HSP_TASK_COMPARATOR_3    = 3U
} HAL_HSP_TASK_ComparatorTypeDef;

/** HAL HSP Task Overlap status */
typedef enum
{
  /** Task Overlapping is disabled */
  HAL_HSP_TCU_TASK_OVERLAP_DISABLED = 0U,

  /** Task Overlapping is enabled */
  HAL_HSP_TCU_TASK_OVERLAP_ENABLED  = 1U,
} HAL_HSP_TCU_Task_Overlap_StatusTypeDef;

/** HAL HSP Task Comparator Unit status */
typedef enum
{
  /** Task Comparator Unit is disabled */
  HAL_HSP_TCU_COMPARATOR_DISABLED = 0U,

  /** Task Comparator Unit is enabled */
  HAL_HSP_TCU_COMPARATOR_ENABLED  = 1U,
} HAL_HSP_TCU_Comparator_StatusTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group4 HSP Event Trigger Source Matrix Enumerations
  * @{
  */
/**
  * @brief  HAL HSP Event Source Definition
  *
  *  +------------------+--------------+------------------+--- ... ---+-------------------+
  *  | Priority (6-bit) | Type (4-bit) |  Idx ITF (5-bit) |  Reserved | reg value (3-bit) |
  *  +------------------+--------------+------------------+--- ... ---+-------------------+
  */
typedef enum
{
  HAL_HSP_EVENT_RESERVED = 0U,

  /* Event 1 source Matrix ****************************************************/
  HAL_HSP_EVENT_1_STREAM0  = ((1U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_1_TRGIN3   = ((1U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_1_TRGIN8   = ((1U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_1_HSEG     = ((1U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_1_CSEG     = ((1U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 2 source Matrix ****************************************************/
  HAL_HSP_EVENT_2_STREAM1  = ((2U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_2_TRGIN4   = ((2U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_2_TRGIN9   = ((2U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_2_HSEG     = ((2U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_2_CSEG     = ((2U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 3 source Matrix ****************************************************/
  HAL_HSP_EVENT_3_STREAM2  = ((3U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_3_TRGIN0   = ((3U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_3_TRGIN5   = ((3U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_3_HSEG     = ((3U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_3_CSEG     = ((3U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 4 source Matrix ****************************************************/
  HAL_HSP_EVENT_4_STREAM3  = ((4U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_4_TRGIN1   = ((4U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_4_TRGIN6   = ((4U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_4_HSEG     = ((4U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_4_CSEG     = ((4U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 5 source Matrix ****************************************************/
  HAL_HSP_EVENT_5_STREAM0  = ((5U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_5_TRGIN2   = ((5U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_5_TRGIN7   = ((5U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_5_HSEG     = ((5U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_5_CSEG     = ((5U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 6 source Matrix ****************************************************/
  HAL_HSP_EVENT_6_STREAM1  = ((6U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_6_TRGIN3   = ((6U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_6_TRGIN8   = ((6U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_6_HSEG     = ((6U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_6_CSEG     = ((6U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 7 source Matrix ****************************************************/
  HAL_HSP_EVENT_7_STREAM2  = ((7U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_7_TRGIN4   = ((7U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_7_TRGIN9   = ((7U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_7_HSEG     = ((7U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_7_CSEG     = ((7U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 8 source Matrix ****************************************************/
  HAL_HSP_EVENT_8_STREAM3  = ((8U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_8_TRGIN0   = ((8U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_8_TRGIN5   = ((8U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_8_HSEG     = ((8U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_8_CSEG     = ((8U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 9 source Matrix ****************************************************/
  HAL_HSP_EVENT_9_STREAM0  = ((9U << HAL_HSP_EVENT_PRIO_POS)
                              | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_9_TRGIN1   = ((9U << HAL_HSP_EVENT_PRIO_POS)
                              | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_9_TRGIN6   = ((9U << HAL_HSP_EVENT_PRIO_POS)
                              | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_9_HSEG     = ((9U << HAL_HSP_EVENT_PRIO_POS)
                              | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_9_CSEG     = ((9U << HAL_HSP_EVENT_PRIO_POS)
                              | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 10 source Matrix ***************************************************/
  HAL_HSP_EVENT_10_STREAM1  = ((10U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_10_TRGIN2   = ((10U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_10_TRGIN7   = ((10U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_10_HSEG     = ((10U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_10_CSEG     = ((10U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 11 source Matrix ***************************************************/
  HAL_HSP_EVENT_11_STREAM2  = ((11U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_11_TRGIN3   = ((11U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_11_TRGIN8   = ((11U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_11_HSEG     = ((11U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_11_CSEG     = ((11U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 12 source Matrix ***************************************************/
  HAL_HSP_EVENT_12_STREAM3  = ((12U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_12_TRGIN4   = ((12U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_12_TRGIN9   = ((12U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_12_HSEG     = ((12U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_12_CSEG     = ((12U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 13 source Matrix ***************************************************/
  HAL_HSP_EVENT_13_STREAM0  = ((13U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_13_TRGIN0   = ((13U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_13_TRGIN5   = ((13U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_13_HSEG     = ((13U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_13_CSEG     = ((13U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 14 source Matrix ***************************************************/
  HAL_HSP_EVENT_14_STREAM1  = ((14U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_14_TRGIN1   = ((14U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_14_TRGIN6   = ((14U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_14_HSEG     = ((14U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_14_CSEG     = ((14U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 15 source Matrix ***************************************************/
  HAL_HSP_EVENT_15_STREAM2  = ((15U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_15_TRGIN2   = ((15U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_15_TRGIN7   = ((15U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_15_HSEG     = ((15U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_15_CSEG     = ((15U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 16 source Matrix ***************************************************/
  HAL_HSP_EVENT_16_STREAM3  = ((16U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_16_TRGIN3   = ((16U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_16_TRGIN8   = ((16U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_16_HSEG     = ((16U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_16_CSEG     = ((16U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 17 source Matrix ***************************************************/
  HAL_HSP_EVENT_17_STREAM0  = ((17U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_17_TRGIN4   = ((17U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_17_TRGIN9   = ((17U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_17_HSEG     = ((17U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_17_CSEG     = ((17U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 18 source Matrix ***************************************************/
  HAL_HSP_EVENT_18_STREAM1  = ((18U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_18_TRGIN0   = ((18U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_18_TRGIN5   = ((18U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_18_HSEG     = ((18U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_18_CSEG     = ((18U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 19 source Matrix ***************************************************/
  HAL_HSP_EVENT_19_STREAM2  = ((19U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_19_TRGIN1   = ((19U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_19_TRGIN6   = ((19U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_19_HSEG     = ((19U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_19_CSEG     = ((19U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 20 source Matrix ***************************************************/
  HAL_HSP_EVENT_20_STREAM3  = ((20U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_20_TRGIN2   = ((20U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_20_TRGIN7   = ((20U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_20_HSEG     = ((20U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_20_CSEG     = ((20U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 21 source Matrix ***************************************************/
  HAL_HSP_EVENT_21_STREAM0  = ((21U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_21_TRGIN3   = ((21U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_21_TRGIN8   = ((21U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_21_HSEG     = ((21U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_21_CSEG     = ((21U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
  /* Event 22 source Matrix ***************************************************/
  HAL_HSP_EVENT_22_STREAM1  = ((22U << HAL_HSP_EVENT_PRIO_POS)
                               | (2U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_22_TRGIN4   = ((22U << HAL_HSP_EVENT_PRIO_POS)
                               | (3U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_22_TRGIN9   = ((22U << HAL_HSP_EVENT_PRIO_POS)
                               | (4U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_22_HSEG     = ((22U << HAL_HSP_EVENT_PRIO_POS)
                               | (5U << HAL_HSP_EVENT_SOURCE_POS)),
  HAL_HSP_EVENT_22_CSEG     = ((22U << HAL_HSP_EVENT_PRIO_POS)
                               | (6U << HAL_HSP_EVENT_SOURCE_POS)),
} HAL_HSP_EVENT_SourceTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group5 HSP Stream Interface Types
  * @{
  */
/** Enumerate to define the ID of STREAM Interface */
typedef enum
{
  HAL_HSP_STREAM_BUFFER_0 = 0UL,
  HAL_HSP_STREAM_BUFFER_1 = 1UL,
  HAL_HSP_STREAM_BUFFER_2 = 2UL,
  HAL_HSP_STREAM_BUFFER_3 = 3UL,
} HAL_HSP_STREAM_BufferTypeDef;

