zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
/** Enumerate to define the STREAM Buffer direction */
typedef enum
{
  HAL_HSP_STREAM_BUFFER_DIRECTION_RX,
  HAL_HSP_STREAM_BUFFER_DIRECTION_TX,
} HAL_HSP_STREAM_Buffer_DirectionTypeDef;

/** Enumerate to define the state of Integer to Float conversion feature */
typedef enum
{
  HAL_HSP_STREAM_BUFFER_SYNC_DISABLE,
  HAL_HSP_STREAM_BUFFER_SYNC_ENABLE,
} HAL_HSP_STREAM_Buffer_Sync_StateTypeDef;

/** Enumerate to define the state of Integer to Float conversion feature */
typedef enum
{
  /** Conversion Integer to Float is disabled */
  HAL_HSP_STREAM_INT_TO_FLOAT_DISABLED,

  /** Conversion Integer to float is enabled */
  HAL_HSP_STREAM_INT_TO_FLOAT_ENABLED,
} HAL_HSP_STREAM_IntToFloat_StatusTypeDef;

/** STREAM configuration structure */
typedef struct
{
  /** STREAM Buffer direction TX or RX */
  HAL_HSP_STREAM_Buffer_DirectionTypeDef direction;

  /** Synchronize the STREAM Buffer with the STREAM Buffer +1 */
  HAL_HSP_STREAM_Buffer_Sync_StateTypeDef sync_state;
} HAL_HSP_STREAM_Buffer_ConfigTypeDef;

/** Enumerate to define the flag status of STREAM Event */
typedef enum
{
  HAL_HSP_STREAM_FLAG_NOT_ACTIVE = 0U,  /*!< Flag not active */
  HAL_HSP_STREAM_FLAG_ACTIVE     = 1U   /*!< Flag active     */
} HAL_HSP_STREAM_FLAG_StatusTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group6 HSP Trigger Interface Types
  * @{
  */
/** Enumerate to define the Trigger polarity */
typedef enum
{
  HAL_HSP_TRGIN_POLARITY_RISING  = 0U,
  HAL_HSP_TRGIN_POLARITY_FALLING = 1U,
} HAL_HSP_TRGIN_PolarityTypeDef;

/** Enumerate to define the Trigger Interconnect Matrix */
typedef enum
{
#if defined(STM32U3C5xx) || defined(STM32U3B5xx)
  HAL_HSP_TRGIN_DMA1_CH1_TC,
  HAL_HSP_TRGIN_DMA1_CH2_TC,
  HAL_HSP_TRGIN_DMA1_CH3_TC,
  HAL_HSP_TRGIN_DMA1_CH4_TC,
#else
  HAL_HSP_TRGIN_DMA1_CH8_TC,
  HAL_HSP_TRGIN_DMA1_CH9_TC,
  HAL_HSP_TRGIN_DMA1_CH10_TC,
  HAL_HSP_TRGIN_DMA1_CH11_TC,
#endif /* STM32U3C5xx || STM32U3B5xx */
  HAL_HSP_TRGIN_EXTI0,
  HAL_HSP_TRGIN_EXTI1,
  HAL_HSP_TRGIN_TIM1_TRGO,
  HAL_HSP_TRGIN_TIM1_TRGO2,
  HAL_HSP_TRGIN_TIM2_TRGO,
  HAL_HSP_TRGIN_TIM3_TRGO,
  HAL_HSP_TRGIN_TIM6_TRGO,
  HAL_HSP_TRGIN_TIM7_TRGO,
  HAL_HSP_TRGIN_TIM8_TRGO,
  HAL_HSP_TRGIN_TIM8_TRGO2,
  HAL_HSP_TRGIN_TIM15_TRGO,
  HAL_HSP_TRGIN_LPTIM1_CH1,
  HAL_HSP_TRGIN_LPTIM1_CH2,
  HAL_HSP_TRGIN_LPTIM2_CH1,
  HAL_HSP_TRGIN_LPTIM2_CH2,
  HAL_HSP_TRGIN_ADF1_SAD_DET
} HAL_HSP_TRGIN_SourceTypeDef;

/** Enumerate to define the enabling status of TRGIN instance */
typedef enum
{
  /** TRGIN is disabled */
  HAL_HSP_TRGIN_DISABLED = 0U,

  /** TRGIN is enabled */
  HAL_HSP_TRGIN_ENABLED  = 1U,
} HAL_HSP_TRGIN_StatusTypeDef;

/** TRIGGER configuration structure */
typedef struct
{
  /** Polarity of the TRGIN Interface */
  HAL_HSP_TRGIN_PolarityTypeDef polarity;

  /** ID of the source signal selected */
  HAL_HSP_TRGIN_SourceTypeDef source;
} HAL_HSP_TRGIN_ConfigTypeDef;

/** Enumerate to define the flag status of TRGIN Event or Error */
typedef enum
{
  HAL_HSP_TRGIN_FLAG_NOT_ACTIVE = 0U,  /*!< Flag not active */
  HAL_HSP_TRGIN_FLAG_ACTIVE     = 1U   /*!< Flag active     */
} HAL_HSP_TRGIN_FLAG_StatusTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group7 HSP Event Types
  * @{
  */

/** Enumerate to define the Event Synchronization State */
typedef enum
{
  /** Event Synchronization must be disabled */
  HAL_HSP_EVENT_SYNC_DISABLE = 0U,

  /** Event Synchronization must be enabled */
  HAL_HSP_EVENT_SYNC_ENABLE  = 1U
} HAL_HSP_EVENT_Sync_StateTypeDef;

/** Event Synchronization structure */
typedef struct
{
  /** Task Comparator Unit used to monitor the end of task */
  HAL_HSP_TASK_ComparatorTypeDef tcu;

  /** Action to enable or disable the synchronization */
  HAL_HSP_EVENT_Sync_StateTypeDef state;
} HAL_HSP_EVENT_SyncTypeDef;

/** Event configuration structure */
typedef struct
{
  /** Event source */
  HAL_HSP_EVENT_SourceTypeDef source;

  /** Synchronize the event with the end of a task execution */
  HAL_HSP_EVENT_SyncTypeDef sync;
} HAL_HSP_EVENT_ConfigTypeDef;

/** HSP Polling Mode on End Of Event Status */
typedef enum
{
  /** Polling is termintated when all selected events occurred */
  HAL_HSP_POLLING_FOR_ALL_EVENT,

  /** Polling is terinated when almost one selected event occurred */
  HAL_HSP_POLLING_FOR_ANY_EVENT,
} HAL_HSP_POLLING_ModeTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group8 HSP Trigger Output Types
  * @{
  */
/** HAL HSP Trigger Output Enumerate */
typedef enum
{
  HAL_HSP_OUTPUT_TRIGGER_0,
  HAL_HSP_OUTPUT_TRIGGER_1,
  HAL_HSP_OUTPUT_TRIGGER_2,
  HAL_HSP_OUTPUT_TRIGGER_3,
} HAL_HSP_OUTPUT_TriggerTypeDef;

/** HAL HSP Trigger Output Source */
typedef enum
{
  HAL_HSP_OUTPUT_TRIGGER_NONE  = 0U,  /*!< Disabled */
  HAL_HSP_OUTPUT_TRIGGER_STREAM = HSP_TRGOCFGR_TRGO0SRC_0, /*!< Trigger from STREAM Interface */
  HAL_HSP_OUTPUT_TRIGGER_CORE = HSP_TRGOCFGR_TRGO0SRC_1,   /*!< Trigger from SPE Core */
  HAL_HSP_OUTPUT_TRIGGER_TIMESTAMPCAPTURE = (HSP_TRGOCFGR_TRGO0SRC_0 | HSP_TRGOCFGR_TRGO0SRC_1),
  /*!< Trigger from TimeStamp Capture */
} HAL_HSP_OUTPUT_TRIGGER_SourceTypeDef;

/** HAL HSP Output status */
typedef enum
{
  HAL_HSP_OUTPUT_DISABLED = 0U,
  HAL_HSP_OUTPUT_ENABLED  = 1U,
} HAL_HSP_OUTPUT_StatusTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group9  HSP TimeStamp Capture Types
  * @{
  */
/** HAL HSP TimeStamp Capture Prescaler */
typedef enum
{
  HAL_HSP_TSC_CAPTURE_MODE_SPE_BREAKS       = HSP_CAPCR_CAPMOD_0,
  HAL_HSP_TSC_CAPTURE_MODE_TASK_NBR_CHANGES = HSP_CAPCR_CAPMOD_1,
  HAL_HSP_TSC_CAPTURE_MODE_PFCT_NBR_CHANGES = (HSP_CAPCR_CAPMOD_1 | HSP_CAPCR_CAPMOD_0),
} HAL_HSP_TSC_Capture_ModeTypeDef;

/** HAL HSP TimeStamp Capture Prescaler */
typedef enum
{
  HAL_HSP_TSC_PRESCALER_BYPASSED = 0U,
  HAL_HSP_TSC_PRESCALER_DIV2     = HSP_CAPCR_PRESC_0,
  HAL_HSP_TSC_PRESCALER_DIV4     = HSP_CAPCR_PRESC_1,
  HAL_HSP_TSC_PRESCALER_DIV8     = HSP_CAPCR_PRESC_1 | HSP_CAPCR_PRESC_0,
  HAL_HSP_TSC_PRESCALER_DIV16    = HSP_CAPCR_PRESC_2,
  HAL_HSP_TSC_PRESCALER_DIV32    = HSP_CAPCR_PRESC_2 | HSP_CAPCR_PRESC_0,
  HAL_HSP_TSC_PRESCALER_DIV64    = HSP_CAPCR_PRESC_2 | HSP_CAPCR_PRESC_1,
  HAL_HSP_TSC_PRESCALER_DIV128   = HSP_CAPCR_PRESC_2 | HSP_CAPCR_PRESC_1 | HSP_CAPCR_PRESC_0,
  HAL_HSP_TSC_PRESCALER_DIV256   = HSP_CAPCR_PRESC_3,
  HAL_HSP_TSC_PRESCALER_DIV512   = HSP_CAPCR_PRESC_3 | HSP_CAPCR_PRESC_0,
  HAL_HSP_TSC_PRESCALER_DIV1024  = HSP_CAPCR_PRESC_3 | HSP_CAPCR_PRESC_1,
  HAL_HSP_TSC_PRESCALER_DIV2048  = HSP_CAPCR_PRESC_3 | HSP_CAPCR_PRESC_1 | HSP_CAPCR_PRESC_0,
  HAL_HSP_TSC_PRESCALER_DIV4096  = HSP_CAPCR_PRESC_3 | HSP_CAPCR_PRESC_2,
  HAL_HSP_TSC_PRESCALER_DIV8192  = HSP_CAPCR_PRESC_3 | HSP_CAPCR_PRESC_2 | HSP_CAPCR_PRESC_0,
  HAL_HSP_TSC_PRESCALER_DIV16384 = HSP_CAPCR_PRESC_3 | HSP_CAPCR_PRESC_2 | HSP_CAPCR_PRESC_1,
  HAL_HSP_TSC_PRESCALER_DIV32768 = HSP_CAPCR_PRESC_3 | HSP_CAPCR_PRESC_2 | HSP_CAPCR_PRESC_1 | HSP_CAPCR_PRESC_0,
} HAL_HSP_TSC_PrescalerTypeDef;

/** HAL HSP TimeStamp Capture Free Running Counter status */
typedef enum
{
  HAL_HSP_TSC_FREE_COUNTER_DISABLE = 0U,
  HAL_HSP_TSC_FREE_COUNTER_ENABLE  = HSP_CAPCR_FRCNTEN
} HAL_HSP_TSC_FreeRunningCounterStateTypeDef;

/** HAL HSP TimeStamp Capture Task Filter mode */
typedef enum
{
  HAL_HSP_TSC_TASK_FILTER_NONE    = 0U,
  HAL_HSP_TSC_TASK_FILTER_TSKCMP0 = HSP_CAPCR_TSKFLT
} HAL_HSP_TSC_TaskFilterTypeDef;

