zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
/** HAL HSP TimeStamp Capture configuration structure */
typedef struct
{
  /** Division ratio in order to define the time stamp granularity (For Free Counter mode only) */
  HAL_HSP_TSC_PrescalerTypeDef prescaler;

  /** Enable the Free counter mode */
  HAL_HSP_TSC_FreeRunningCounterStateTypeDef counter;

  /** Enable the filtering for a task monitored by the Task Comparator Unit 0 */
  HAL_HSP_TSC_TaskFilterTypeDef filter;
} HAL_HSP_TSC_ConfigTypeDef;

/** HAL HSP TimeStamp Capture status */
typedef enum
{
  HAL_HSP_TSC_DISABLED = 0U,
  HAL_HSP_TSC_ENABLED  = 1U,
} HAL_HSP_TSC_StatusTypeDef;

/** HAL HSP TimeStamp Data structure */
typedef struct
{
  /** Last captured task number */
  uint32_t task_number;

  /** IF instruction counter */
  uint32_t if_counter;

  /** IF condition history */
  uint32_t if_history;

  /** Time-stamp value */
  uint32_t timestamp;

  /** Last captured processing function number */
  uint32_t pfct_number;
} HAL_HSP_TSC_TimeStampTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group10  HSP BRAM Types
  * @{
  */
/** HAL HSP BRAM Bandwidth Arbitration enumerate */
typedef enum
{
  HAL_HSP_BRAM_ARBITRATION_LATENCY_16_CYCLES = 0UL,
  HAL_HSP_BRAM_ARBITRATION_LATENCY_8_CYCLES  = HSP_CR_BARB_0,
  HAL_HSP_BRAM_ARBITRATION_LATENCY_4_CYCLES  = HSP_CR_BARB_1
} HAL_HSP_BRAM_ArbitrationTypeDef;

/**
  * @}
  */

/** @defgroup HSP_Exported_Types_Group12  HSP Debug Types
  * @{
  */
/** HAL HSP BREAK Output Definition */
typedef enum
{
  HAL_HSP_BREAK_OUTPUT_0 = 0U,
  HAL_HSP_BREAK_OUTPUT_1 = 1U,
  HAL_HSP_BREAK_OUTPUT_2 = 2U,
  HAL_HSP_BREAK_OUTPUT_3 = 3U
} HAL_HSP_BREAK_OutputTypeDef;

/** HAL HSP BREAK Critical Event status */
typedef enum
{
  HAL_HSP_BREAK_CRITICAL_EVENT_DISABLED = 0U,
  HAL_HSP_BREAK_CRITICAL_EVENT_ENABLED  = 1U
} HAL_HSP_BREAK_Critical_Event_StatusTypeDef;

/** HAL HSP BREAK Freeze Event status */
typedef enum
{
  HAL_HSP_BREAK_FREEZE_EVENT_DISABLED = 0U,
  HAL_HSP_BREAK_FREEZE_EVENT_ENABLED  = 1U
} HAL_HSP_BREAK_Freeze_Event_StatusTypeDef;

/** HAL HSP BREAK Freeze Event status */
typedef enum
{
  HAL_HSP_SPE_IT_DISABLED = 0U,
  HAL_HSP_SPE_IT_ENABLED  = 1U
} HAL_HSP_SPE_IT_StatusTypeDef;

/**
  * @}
  */
/** @defgroup HSP_Exported_Types_Group14  HSP Handle
  * @{
  */
/** HSP HAL Handle State enumeration */
typedef enum
{
  HAL_HSP_STATE_RESET          = 0UL,           /*!< HSP not yet initialized                                 */
  HAL_HSP_STATE_INIT           = (1UL << 31U),  /*!< HSP initialized but not yet configured                  */
  HAL_HSP_STATE_READY_TO_BOOT  = (1UL << 28U),  /*!< HSP DRAM FW loaded, Plugin can be loaded before to Boot */
  HAL_HSP_STATE_RUNNING        = (1UL << 27U),  /*!< HSP initialized, FW & Plugin Loaded and Boot completed  */
  HAL_HSP_STATE_FAULT          = (1UL << 0U)    /*!< HSP Boot uncoverable failure. A HW reset is required    */
} HAL_HSP_StateTypeDef;

/** HAL HSP Handle type definition */
typedef struct hal_hsp_handle_s HSP_HandleTypeDef;

#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
/** Pointer to a HSP callback function */
typedef void (*pHSP_CallbackTypeDef)(HSP_HandleTypeDef *hhsp);

/** Pointer to a HSP callback function taking 1 parameter in addition to the handle */
typedef void (*pHSP_OneParamCallbackTypeDef)(HSP_HandleTypeDef *hhsp, uint32_t value);

/** Pointer to a HSP callback function taking 2 parameters in addition to the handle */
typedef void (*pHSP_TwoParamsCallbackTypeDef)(HSP_HandleTypeDef *hhsp, uint32_t value1, uint32_t value2);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */

/** HAL HSP Handle Structure definition */
struct hal_hsp_handle_s
{
  /** HAL HSP instance */
  HSP_TypeDef *Instance;

  /** HSP global state */
  __IO HAL_HSP_StateTypeDef global_state;

  __IO uint32_t last_error_codes;  /*!< Errors limited to the last process
                                        This parameter can be a combination of @ref HSP_HAL_Error_Codes */
  __IO uint32_t boot_error_code;   /*!< Boot Error code
                                        This parameter can be a value of @ref HSP_Firmware_Error_Codes  */
  __IO uint32_t last_msgbox_error_code; /*!< MsgBox error code */

  /* CRAM/DRAM Memory region -------------------------------------------------*/
  /** Free CRAM Size in word */
  uint32_t cram_free_size_in_word;

  /** Free DRAM Size in word */
  uint32_t dram_free_size_in_word;

  /** CRAM Address to load the next plugin */
  uint32_t cram_address_for_plugin;

  /** Address of HSP Performance Counter */
  uint32_t *p_perf_counter;

  /* CNN Safe mode -----------------------------------------------------------*/
  /** Store the status of Enabled Interface */
  uint32_t backup_enabled_itfs;

  /** Store the status of Enabled Events */
  uint32_t backup_enabled_events;

  /** Store the status of Enabled Event Interrupts */
  uint32_t backup_event_its;

  /** Store the status of Enabled Processing Function Event Interrupts */
  uint32_t backup_pfctevt_its;

  /* Sub-Routine for IRQ Handlers --------------------------------------------*/
  /** HSP subroutine to process STREAM buffer Events */
  void(*stream_handler)(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);

  /** HSP subroutine to process Task Comparator Unit Events */
  void(*tcu_handler)(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);

  /** HSP subroutine to process SPE Events */
  void(*spe_handler)(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);

  /** HSP subroutine to process Timestamp Capture Events */
  void(*tsc_handler)(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);

  /** HSP subroutine to process Command Events */
  void(*cmd_handler)(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);

  /** HSP subroutine to process STREAM buffer Errors */
  void(*stream_err_handler)(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);

  /** HSP subroutine to process TRGIN Errors */
  void(*trgin_err_handler)(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);

  /** HSP subroutine to process Timestamp Capture Errors */
  void(*tsc_err_handler)(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);

  /** HSP subroutine to process SPE Errors */
  void(*spe_err_handler)(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);

