zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
  /** HSP subroutine to process Processing Function Events */
  void(*fwevt_handler)(HSP_HandleTypeDef *hhsp, uint32_t reg_fwevt_misr);

  /* Interrupts callbacks ----------------------------------------------------*/
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
  /** HSP SPE Run State callback function pointer */
  void (* EVT_SPE_RunStateCallback)(HSP_HandleTypeDef *hhsp, uint32_t state);

  /** HSP SPE Task Completed callback function pointer */
  void (* EVT_SPE_TaskCpltCallback)(HSP_HandleTypeDef *hhsp);

  /** HSP SPE Direct Command Completed callback function pointer */
  void (* EVT_SPE_DirectCommandCpltCallback)(HSP_HandleTypeDef *hhsp);

  /** HSP SPE FPU Saturation event callback function pointer */
  void (* EVT_SPE_FPUSaturationCallback)(HSP_HandleTypeDef *hhsp);

  /** HSP Timestamp Capture Data Ready callback function pointer */
  void (* EVT_TSC_TimestampReadyCallback)(HSP_HandleTypeDef *hhsp, uint32_t timestamp);

  /** HSP Task Comparator Unit Task Started callback function pointer */
  void (* EVT_TCU_TaskStartedCallback)(HSP_HandleTypeDef *hhsp, uint32_t comparators_mask);

  /** HSP Task Comparator Unit Task Ended callback function pointer */
  void (* EVT_TCU_TaskEndedCallback)(HSP_HandleTypeDef *hhsp, uint32_t comparators_mask);

  /** HSP Task Overlap event callback function pointer */
  void (* EVT_TCU_TaskOverlapCallback)(HSP_HandleTypeDef *hhsp);

  /** HSP STREAM Buffer Empty callback function pointer */
  void (* EVT_STREAM_BufferEmptyCallback)(HSP_HandleTypeDef *hhsp, uint32_t buffers_mask);

  /** HSP STREAM Buffer Full callback function pointer */
  void (* EVT_STREAM_BufferFullCallback)(HSP_HandleTypeDef *hhsp, uint32_t buffers_mask);

  /** HSP Processing Function Event callback function pointer */
  void (* FWEVT_ProcessingEventCallback)(HSP_HandleTypeDef *hhsp, uint32_t events_mask);

  /** HSP Error callback function pointer */
  void (* ErrorCallback)(HSP_HandleTypeDef *hhsp, uint32_t fw_error_code, uint32_t spe_error_inf);

  /** HSP MSP Init callback function pointer */
  void (* MspInitCallback)(HSP_HandleTypeDef *hhsp);

  /** HSP MSP DeInit callback function pointer */
  void (* MspDeInitCallback)(HSP_HandleTypeDef *hhsp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
};

/** HAL HSP Capabilities Structure definition */
typedef struct
{
  uint32_t bramab_base_address;
  uint32_t bramab_size_byte;
  uint32_t brama_base_address;
  uint32_t bramb_base_address;

} HAL_HSP_CapabilitiesTypeDef;

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup HSP_Exported_Functions HSP Exported Functions
  * @{
  */

/** @defgroup HSP_Exported_Functions_Group1  HSP Initialization and de-initialization functions
  * @{
  */
/* Init/DeInit functions ******************************************************/
HAL_StatusTypeDef HAL_HSP_Init(HSP_HandleTypeDef *hhsp);
HAL_StatusTypeDef HAL_HSP_DeInit(HSP_HandleTypeDef *hhsp);
void HAL_HSP_MspInit(HSP_HandleTypeDef *hhsp);
void HAL_HSP_MspDeInit(HSP_HandleTypeDef *hhsp);

/* Firmware/Plugin functions **************************************************/
HAL_StatusTypeDef HAL_HSP_LoadFirmware(HSP_HandleTypeDef *hhsp,
                                       const uint8_t *p_cram_bin, uint32_t cram_size_bytes,
                                       const uint8_t *p_dram_bin, uint32_t dram_size_bytes);
HAL_StatusTypeDef HAL_HSP_LoadPlugin(HSP_HandleTypeDef *hhsp, const uint8_t *p_plugin_bin, uint32_t size_bytes);

/* Boot functions *************************************************************/
HAL_StatusTypeDef HAL_HSP_Boot(HSP_HandleTypeDef *hhsp, const HAL_HSP_Boot_ConfigTypeDef *p_config,
                               uint32_t timeout_ms);
uint32_t HAL_HSP_GetFirmwareVersion(const HSP_HandleTypeDef *hhsp);

HAL_StatusTypeDef HAL_HSP_GetCapabilities(HSP_HandleTypeDef *hhsp, HAL_HSP_CapabilitiesTypeDef *p_capabilities);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group2  HSP Command Management
  * @{
  */
/**
  * @brief  Write a Command into the Direct Command interface.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  cmd_id  Command ID
  */
__STATIC_FORCEINLINE void HAL_HSP_DIRECT_WriteCommand(const HSP_HandleTypeDef *hhsp, uint32_t cmd_id)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;
  STM32_WRITE_REG(p_hspx->DCMDIDR, cmd_id);
}

/**
  * @brief  Write a Data Pointer into the Direct Command interface.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  ptr_id  Data Pointer ID
  * @param  data_address  Data Address
  */
__STATIC_FORCEINLINE void HAL_HSP_DIRECT_WriteDataPointer(const HSP_HandleTypeDef *hhsp,
                                                          HAL_HSP_DIRECT_CMD_Data_PtrTypeDef ptr_id,
                                                          uint32_t data_address)
{
  __IO uint32_t *reg_ptr0 = (uint32_t __IO *) & (((HSP_TypeDef *)(uint32_t)(hhsp->Instance))->DCMDPTR0);
  STM32_WRITE_REG(reg_ptr0[(uint32_t)ptr_id], data_address);
}

/**
  * @brief  Fill a parameter for any HSP command for DCMD or MSGBox interfaces.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  param_id  ID of parameter
  * @param  value     value.
  */
__STATIC_FORCEINLINE void HAL_HSP_WriteParameter(const HSP_HandleTypeDef *hhsp,
                                                 HAL_HSP_PARAMTypeDef param_id, uint32_t value)
{
  __IO uint32_t *reg_param0 = (uint32_t __IO *) & (((HSP_TypeDef *)(uint32_t)(hhsp->Instance))->PARAMR0);

  STM32_WRITE_REG(reg_param0[(uint32_t)param_id], value);
}

/**
  * @brief  Return the value of a parameter.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  param_id  ID of parameter
  * @return  Value.
  */
__STATIC_FORCEINLINE uint32_t HAL_HSP_ReadParameter(const HSP_HandleTypeDef *hhsp, HAL_HSP_PARAMTypeDef param_id)
{
  const __IO uint32_t *reg_param0 = (uint32_t volatile *) & (hhsp->Instance->PARAMR0);

  return STM32_READ_REG(reg_param0[(uint32_t)param_id]);
}

