zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
HAL_StatusTypeDef HAL_HSP_DIRECT_WaitEndOfCommand(const HSP_HandleTypeDef *hhsp, uint32_t timeout_ms);

/**
  * @brief Get the status of Direct Command processing.
  * @param hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_HSP_DIRECT_CMD_BUSY   Direct Command is in progress.
  * @retval HAL_HSP_DIRECT_CMD_READY  Direct Command Interface is readay for a new process.
  */
__STATIC_FORCEINLINE HAL_HSP_DIRECT_CMD_StatusTypeDef HAL_HSP_DIRECT_IsCommandReady(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx = hhsp->Instance;

  return ((STM32_READ_BIT(p_hspx->DCMDSR, HSP_DCMDSR_DCBSY) != 0U) ? HAL_HSP_DIRECT_CMD_BUSY :
          HAL_HSP_DIRECT_CMD_READY);
}

HAL_StatusTypeDef HAL_HSP_MSGBOX_SendCommand(HSP_HandleTypeDef *hhsp, uint32_t cmd_id, uint32_t timeout_ms);

/**
  * @brief Get the Status of MSGBox Semaphore (CPU side).
  * @param hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_HSP_MSGBOX_SEMAPHORE_NO_MSG         No Message.
  * @retval HAL_HSP_MSGBOX_SEMAPHORE_MSG_AVAILABLE  A Message is ready to be read.
  */
__STATIC_FORCEINLINE HAL_HSP_MSGBOX_Semaphore_StatusTypeDef HAL_HSP_MSGBOX_IsMsgAvailable(
  const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx = hhsp->Instance;

  return ((STM32_READ_BIT(p_hspx->H2CSEMR, HSP_H2CSEMR_H2CSEM) != 0U) ? HAL_HSP_MSGBOX_SEMAPHORE_MSG_AVAILABLE :
          HAL_HSP_MSGBOX_SEMAPHORE_NO_MSG);
}

/**
  * @brief Release the MSGBOX Semaphore to signal the CPU has read the HSP message.
  * @param hhsp  Pointer to a @ref HSP_HandleTypeDef.
  */
__STATIC_FORCEINLINE void HAL_HSP_MSGBOX_ReleaseSemaphore(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;

  STM32_SET_BIT(p_hspx->H2CSEMR, HSP_H2CSEMR_H2CSEM);
}

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group3_2 HSP STREAM Interface
  * @{
  */
/* STREAM Interface ----------------------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_STREAM_SetConfig(HSP_HandleTypeDef *hhsp, HAL_HSP_STREAM_BufferTypeDef stream_id,
                                           const HAL_HSP_STREAM_Buffer_ConfigTypeDef *p_config);
HAL_StatusTypeDef HAL_HSP_STREAM_GetConfig(HSP_HandleTypeDef *hhsp, HAL_HSP_STREAM_BufferTypeDef stream_id,
                                           HAL_HSP_STREAM_Buffer_ConfigTypeDef *p_config);

HAL_StatusTypeDef HAL_HSP_STREAM_Start(HSP_HandleTypeDef *hhsp,
                                       uint32_t interrupt_evt_mask, uint32_t interrupt_err_mask);
HAL_StatusTypeDef HAL_HSP_STREAM_Stop(HSP_HandleTypeDef *hhsp);

HAL_StatusTypeDef HAL_HSP_STREAM_EnableIntToFloat(const HSP_HandleTypeDef *hhsp);
HAL_StatusTypeDef HAL_HSP_STREAM_DisableIntToFloat(const HSP_HandleTypeDef *hhsp);
HAL_HSP_STREAM_IntToFloat_StatusTypeDef HAL_HSP_STREAM_IsEnabledIntToFloat(const HSP_HandleTypeDef *hhsp);

/**
  * @brief  Write a data into the STREAM Buffer.
  * @param  hhsp       Pointer to a HSP_HandleTypeDef.
  * @param  stream_id  STREAM Buffer id.
  * @param  value      Value to be written.
  */
__STATIC_INLINE void HAL_HSP_STREAM_WriteBufferData(HSP_HandleTypeDef *hhsp,
                                                    HAL_HSP_STREAM_BufferTypeDef stream_id,
                                                    uint32_t value)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;

  STM32_WRITE_REG(p_hspx->BUFFDR[(uint32_t)stream_id], value);
}

/**
  * @brief  Read the value from the STREAM Buffer.
  * @param  hhsp       Pointer to a HSP_HandleTypeDef.
  * @param  stream_id  STREAM Buffer id.
  * @return Return the value from the STREAM Buffer Operation completed successfully.
  */
__STATIC_INLINE uint32_t HAL_HSP_STREAM_ReadBufferData(const HSP_HandleTypeDef *hhsp,
                                                       HAL_HSP_STREAM_BufferTypeDef stream_id)
{
  const HSP_TypeDef *p_hspx = hhsp->Instance;

  return STM32_READ_REG(p_hspx->BUFFDR[(uint32_t)stream_id]);
}

/**
  * @brief  Check whether the selected HSP STREAM Buffer flag is set or not.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  * @param  flag  specifies the HSP flag to check
  *         This parameter can be one of the following values:
  *            @arg HAL_HSP_FLAG_EVT_STREAM_BUFFER_0: HSP STREAM Buffer 0 Ready flag
  *            @arg HAL_HSP_FLAG_EVT_STREAM_BUFFER_1: HSP STREAM Buffer 1 Ready flag
  *            @arg HAL_HSP_FLAG_EVT_STREAM_BUFFER_2: HSP STREAM Buffer 2 Ready flag
  *            @arg HAL_HSP_FLAG_EVT_STREAM_BUFFER_3: HSP STREAM Buffer 3 Ready flag
  * @return retrieve the status of the selected HSP flag.
  */
__STATIC_INLINE HAL_HSP_STREAM_FLAG_StatusTypeDef HAL_HSP_STREAM_IsActiveFlag_Event(const HSP_HandleTypeDef *hhsp,
    uint32_t flag)
{
  const HSP_TypeDef *p_hspx = hhsp->Instance;

  return ((STM32_READ_BIT(p_hspx->EVT_ISR, flag) != 0U) ? HAL_HSP_STREAM_FLAG_ACTIVE : HAL_HSP_STREAM_FLAG_NOT_ACTIVE);
}

/**
  * @brief  Check whether the selected HSP STREAM Buffer Error flag is set or not.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  * @param  flag  specifies the HSP flag to check
  *         This parameter can be one of the following values:
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_0: HSP STREAM Buffer 0 TX UDR / RX OVR flag
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_1: HSP STREAM Buffer 1 TX UDR / RX OVR flag
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_2: HSP STREAM Buffer 2 TX UDR / RX OVR flag
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_3: HSP STREAM Buffer 3 TX UDR / RX OVR flag
  * @return retrieve the status of the selected HSP flag.
  */
__STATIC_INLINE HAL_HSP_STREAM_FLAG_StatusTypeDef HAL_HSP_STREAM_IsActiveFlag_Error(const HSP_HandleTypeDef *hhsp,
    uint32_t flag)
{
  const HSP_TypeDef *p_hspx = hhsp->Instance;

  return ((STM32_READ_BIT(p_hspx->ERR_ISR, flag) != 0U) ? HAL_HSP_STREAM_FLAG_ACTIVE : HAL_HSP_STREAM_FLAG_NOT_ACTIVE);
}

/** @brief  Clears the specified HSP STREAM Buffer Error flag.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  * @param  flags specifies the HSP clear register flag that needs to be set
  *         This parameter can be any combination of the following values:
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_0: HSP STREAM Buffer 0 TX UDR / RX OVR flag
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_1: HSP STREAM Buffer 1 TX UDR / RX OVR flag
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_2: HSP STREAM Buffer 2 TX UDR / RX OVR flag
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_3: HSP STREAM Buffer 3 TX UDR / RX OVR flag
  *            @arg HAL_HSP_FLAG_ERR_STREAM_BUFFER_ALL:  All HSP STREAM Buffer Error flags
  */
__STATIC_INLINE void HAL_HSP_STREAM_ClearFlag_Error(const HSP_HandleTypeDef *hhsp, uint32_t flags)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;

  STM32_WRITE_REG(p_hspx->ERR_ICR, flags);
}

volatile uint32_t *HAL_HSP_STREAM_GetBufferAddress(const HSP_HandleTypeDef *hhsp,
                                                   HAL_HSP_STREAM_BufferTypeDef stream_id);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group3_3 HSP TRGIN Interface
  * @{
  */
/* TRGIN Interface -----------------------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_TRGIN_SetConfig(HSP_HandleTypeDef *hhsp, uint32_t trgin_ids,
                                          const HAL_HSP_TRGIN_ConfigTypeDef *p_config);
HAL_StatusTypeDef HAL_HSP_TRGIN_GetConfig(HSP_HandleTypeDef *hhsp, uint32_t trgin_id,
                                          HAL_HSP_TRGIN_ConfigTypeDef *p_config);

HAL_StatusTypeDef HAL_HSP_TRGIN_Enable(HSP_HandleTypeDef *hhsp, uint32_t trgin_ids);
HAL_StatusTypeDef HAL_HSP_TRGIN_Disable(HSP_HandleTypeDef *hhsp, uint32_t trgin_ids);
HAL_HSP_TRGIN_StatusTypeDef HAL_HSP_TRGIN_IsEnabled(const HSP_HandleTypeDef *hhsp, uint32_t trgin_id);

