zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
HAL_StatusTypeDef HAL_HSP_TRGIN_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts);
HAL_StatusTypeDef HAL_HSP_TRGIN_DisableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts);
uint32_t HAL_HSP_TRGIN_IsEnabledIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupts);

/**
  * @brief  Check whether the HSP TRGIN Overrun Error flag is set or not.
  * @param  hhsp specifies the HSP Handle.
  * @return retrieve the status of the selected HSP flag.
  */
__STATIC_INLINE HAL_HSP_TRGIN_FLAG_StatusTypeDef HAL_HSP_TRGIN_IsActiveFlag_Overrun(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx = hhsp->Instance;

  return ((STM32_READ_BIT(p_hspx->ERR_ISR, HAL_HSP_FLAG_ERR_TRGIN_OVR) != 0U) ? HAL_HSP_TRGIN_FLAG_ACTIVE :
          HAL_HSP_TRGIN_FLAG_NOT_ACTIVE);
}

/** @brief  Clear the specified HSP TRGIN Overrun Error flag status.
  * @param  hhsp specifies the HSP Handle.
  */
__STATIC_INLINE void HAL_HSP_TRGIN_ClearFlag_Overrun(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;

  STM32_WRITE_REG(p_hspx->ERR_ICR, HAL_HSP_FLAG_ERR_TRGIN_OVR);
}

uint32_t HAL_HSP_TRGIN_GetOverrun(const HSP_HandleTypeDef *hhsp);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group3_4 HSP Event Common management
  * @{
  */
/* Event Management ----------------------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_EVENT_SetConfig(HSP_HandleTypeDef *hhsp,
                                          const HAL_HSP_EVENT_ConfigTypeDef *p_config);
HAL_StatusTypeDef HAL_HSP_EVENT_GetConfig(HSP_HandleTypeDef *hhsp, uint32_t event_id,
                                          HAL_HSP_EVENT_ConfigTypeDef *p_config);
HAL_StatusTypeDef HAL_HSP_EVENT_Enable(HSP_HandleTypeDef *hhsp, uint32_t events);
HAL_StatusTypeDef HAL_HSP_EVENT_Disable(HSP_HandleTypeDef *hhsp, uint32_t events);
uint32_t HAL_HSP_EVENT_GetStatus(const HSP_HandleTypeDef *hhsp);

/* API to run the execution of a Processing List with CSEG ********************/
HAL_StatusTypeDef HAL_HSP_EVENT_RequestSWTrigger(HSP_HandleTypeDef *hhsp, uint32_t events);

HAL_StatusTypeDef HAL_HSP_EVENT_PollForPending(HSP_HandleTypeDef *hhsp, HAL_HSP_POLLING_ModeTypeDef poll_mode,
                                               uint32_t events, uint32_t timeout_ms,
                                               uint32_t *p_events_status);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group4 HSP Power Consumption Control
  * @{
  */
/* Power Consumption Control **************************************************/
HAL_StatusTypeDef HAL_HSP_SMARTCLOCKING_Enable(HSP_HandleTypeDef *hhsp, uint32_t clocks);
HAL_StatusTypeDef HAL_HSP_SMARTCLOCKING_Disable(HSP_HandleTypeDef *hhsp, uint32_t clocks);
uint32_t HAL_HSP_SMARTCLOCKING_IsEnabled(const HSP_HandleTypeDef *hhsp, uint32_t clock);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group5 HSP Task Comparator management
  * @{
  */
/* Start/End of Task Detector ------------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_TCU_StartComparator(HSP_HandleTypeDef *hhsp,
                                              HAL_HSP_TASK_ComparatorTypeDef tcu_id, HAL_HSP_TaskTypeDef task_id,
                                              uint32_t interrupts);
HAL_StatusTypeDef HAL_HSP_TCU_StopComparator(HSP_HandleTypeDef *hhsp, HAL_HSP_TASK_ComparatorTypeDef tcu_id);

/* Task Overlap Detector -----------------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_TCU_StartOverlapDetector(HSP_HandleTypeDef *hhsp,
                                                   HAL_HSP_TaskTypeDef lower_task_id,
                                                   HAL_HSP_TaskTypeDef higher_task_id,
                                                   uint32_t interrupts);
HAL_StatusTypeDef HAL_HSP_TCU_StopOverlapDetector(HSP_HandleTypeDef *hhsp);

/* Events/Interrupts Management ----------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_TCU_PollForEvent(HSP_HandleTypeDef *hhsp,
                                           HAL_HSP_POLLING_ModeTypeDef poll_mode, uint32_t flags,
                                           uint32_t timeout_ms, uint32_t *p_flags_status);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group6 HSP Trigger Output management
  * @{
  */
HAL_StatusTypeDef HAL_HSP_OUTPUT_SetConfigTrigger(HSP_HandleTypeDef *hhsp,
                                                  HAL_HSP_OUTPUT_TriggerTypeDef id,
                                                  HAL_HSP_OUTPUT_TRIGGER_SourceTypeDef source);
HAL_HSP_OUTPUT_TRIGGER_SourceTypeDef HAL_HSP_OUTPUT_GetConfigTrigger(const HSP_HandleTypeDef *hhsp,
                                                                     HAL_HSP_OUTPUT_TriggerTypeDef id);
HAL_StatusTypeDef HAL_HSP_OUTPUT_Enable(HSP_HandleTypeDef *hhsp);
HAL_StatusTypeDef HAL_HSP_OUTPUT_Disable(HSP_HandleTypeDef *hhsp);
HAL_HSP_OUTPUT_StatusTypeDef HAL_HSP_OUTPUT_IsEnabled(const HSP_HandleTypeDef *hhsp);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group7 HSP Timestamp Capture
  * @{
  */
HAL_StatusTypeDef HAL_HSP_TSC_SetConfig(HSP_HandleTypeDef *hhsp, const HAL_HSP_TSC_ConfigTypeDef *p_config);
HAL_StatusTypeDef HAL_HSP_TSC_GetConfig(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_ConfigTypeDef *p_config);

/* Polling */
HAL_StatusTypeDef HAL_HSP_TSC_Enable(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_Capture_ModeTypeDef cap_mode);
HAL_StatusTypeDef HAL_HSP_TSC_Disable(HSP_HandleTypeDef *hhsp);

uint32_t HAL_HSP_TSC_IsActiveFlag(const HSP_HandleTypeDef *hhsp);
HAL_StatusTypeDef HAL_HSP_TSC_GetTimeStamp(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_TimeStampTypeDef *p_timestamp);

/* IT */
HAL_StatusTypeDef HAL_HSP_TSC_Enable_IT(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_Capture_ModeTypeDef cap_mode);
HAL_StatusTypeDef HAL_HSP_TSC_Disable_IT(HSP_HandleTypeDef *hhsp);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group8 HSP Performance
  * @{
  */
/* BRAM Access Control -------------------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_BRAM_EnableConflictAccessCounter(const HSP_HandleTypeDef *hhsp);
HAL_StatusTypeDef HAL_HSP_BRAM_DisableConflictAccessCounter(const HSP_HandleTypeDef *hhsp);
uint32_t HAL_HSP_BRAM_IsEnabledConflictAccessCounter(const HSP_HandleTypeDef *hhsp);
uint32_t HAL_HSP_BRAM_GetConflictAccessCounter(const HSP_HandleTypeDef *hhsp);
HAL_StatusTypeDef HAL_HSP_BRAM_SetBandwidthArbitration(const HSP_HandleTypeDef *hhsp,
                                                       HAL_HSP_BRAM_ArbitrationTypeDef mode);
HAL_HSP_BRAM_ArbitrationTypeDef HAL_HSP_BRAM_GetBandwidthArbitration(const HSP_HandleTypeDef *hhsp);

