zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/include/stm32u3xx_hal_hsp.h
/* SPE Performance Monitoring ------------------------------------------------*/
uint32_t HAL_HSP_GetPerformanceCycleCount(const HSP_HandleTypeDef *hhsp);

/**
  * @brief  Get the Firmware Error interrupt status.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  * @return The state of flag: 1 or 0.
  */
__STATIC_INLINE uint8_t HAL_HSP_IsActiveFlag_FirmwareError(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx = hhsp->Instance;

  return (uint8_t)((STM32_READ_BIT(p_hspx->ERR_ISR, HSP_ERR_ISR_FWERRF) != 0U) ? 1U : 0U);
}

/**
  * @brief  Clear Firmware Error Flag.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  */
__STATIC_INLINE void HAL_HSP_ClearFlag_FirmwareError(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;

  STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_FWERRC);
}

uint32_t HAL_HSP_GetFirmwareError(const HSP_HandleTypeDef *hhsp);

/* SPE Interrupts ------------------------------------------------------------*/
HAL_StatusTypeDef HAL_HSP_SPE_EVENT_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts);
HAL_StatusTypeDef HAL_HSP_SPE_EVENT_DisableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts);
HAL_HSP_SPE_IT_StatusTypeDef HAL_HSP_SPE_EVENT_IsEnabledIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupt);

HAL_StatusTypeDef HAL_HSP_SPE_ERROR_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts);
HAL_StatusTypeDef HAL_HSP_SPE_ERROR_DisableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts);
HAL_HSP_SPE_IT_StatusTypeDef HAL_HSP_SPE_ERROR_IsEnabledIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupt);

/** @brief  Clears the specified HSP SPE flag.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  * @param  flags specifies the HSP clear register flag that needs to be set
  *         This parameter can be any combination of the following values:
  *            @arg HAL_HSP_FLAG_EVT_SPE_ENTER_IN_WFE: HSP SPE Enter In WFE mode flag
  *            @arg HAL_HSP_FLAG_EVT_SPE_EXIT_FROM_WFE: HSP SPE Exit From WFE mode flag
  */
__STATIC_INLINE void HAL_HSP_SPE_ClearFlag_Event(const HSP_HandleTypeDef *hhsp, uint32_t flags)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;

  STM32_WRITE_REG(p_hspx->EVT_ICR, flags);
}

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group9 HSP Snoop
  * @{
  */
HAL_StatusTypeDef HAL_HSP_SNOOP_Enable(const HSP_HandleTypeDef *hhsp, uint32_t signals);
HAL_StatusTypeDef HAL_HSP_SNOOP_Disable(const HSP_HandleTypeDef *hhsp, uint32_t group_id);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group10 HSP Break Interface
  * @{
  */
HAL_StatusTypeDef HAL_HSP_BREAK_EnableCriticalEvent(const HSP_HandleTypeDef *hhsp,
                                                    HAL_HSP_BREAK_OutputTypeDef output_id, uint32_t events);
HAL_StatusTypeDef HAL_HSP_BREAK_DisableCriticalEvent(const HSP_HandleTypeDef *hhsp,
                                                     HAL_HSP_BREAK_OutputTypeDef output_id, uint32_t events);
HAL_HSP_BREAK_Critical_Event_StatusTypeDef HAL_HSP_BREAK_IsEnabledCriticalEvent(const HSP_HandleTypeDef *hhsp,
                                                                                HAL_HSP_BREAK_OutputTypeDef output_id,
                                                                                uint32_t event);

HAL_StatusTypeDef HAL_HSP_BREAK_EnableFreezeEvent(const HSP_HandleTypeDef *hhsp, uint32_t events);
HAL_StatusTypeDef HAL_HSP_BREAK_DisableFreezeEvent(const HSP_HandleTypeDef *hhsp, uint32_t events);
HAL_HSP_BREAK_Freeze_Event_StatusTypeDef HAL_HSP_BREAK_IsEnabledFreezeEvent(const HSP_HandleTypeDef *hhsp,
                                                                            uint32_t event);
/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group11 HSP Protection
  * @{
  */
HAL_StatusTypeDef HAL_HSP_Lock(const HSP_HandleTypeDef *hhsp);

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group12 HSP Processing List management
  * @{
  */
HAL_StatusTypeDef HAL_HSP_TASK_Run(const HSP_HandleTypeDef *hhsp, HAL_HSP_TaskTypeDef task_id, uint32_t timeout_ms);
HAL_StatusTypeDef HAL_HSP_TASK_Run_IT(HSP_HandleTypeDef *hhsp, HAL_HSP_TaskTypeDef task_id);

/* Processing Function Notification Management */
/* API to manage the 32 flags for Process */
HAL_StatusTypeDef HAL_HSP_PROCLIST_PollForNotification(HSP_HandleTypeDef *hhsp,
                                                       HAL_HSP_POLLING_ModeTypeDef poll_mode, uint32_t pfct_events,
                                                       uint32_t timeout_ms, uint32_t *p_pfct_events_status);
HAL_StatusTypeDef HAL_HSP_PROCLIST_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts);
HAL_StatusTypeDef HAL_HSP_PROCLIST_DisableIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupts);
uint32_t HAL_HSP_PROCLIST_IsEnabledIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupts);
/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group11_1 HSP CNN Safe Mode Execution
  * @{
  */
HAL_StatusTypeDef HAL_HSP_CNN_EnterSafeMode(HSP_HandleTypeDef *hhsp);
HAL_StatusTypeDef HAL_HSP_CNN_ExitSafeMode(const HSP_HandleTypeDef *hhsp);

/**
  * @brief Send a CNN command.
  * @param hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param cnn_cmd_id  CNN command id.
  * @note  This function is dedicated for CNN function usage.
  */
__STATIC_FORCEINLINE void HAL_HSP_CNN_Run(const HSP_HandleTypeDef *hhsp, uint32_t cnn_cmd_id)
{
  HSP_TypeDef *p_hspx = hhsp->Instance;

  STM32_WRITE_REG(p_hspx->CDEGR, cnn_cmd_id);
}

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group13 HSP IRQ Handler and Callbacks functions
  * @{
  */
/* Global IRQ Handler *********************************************************/
void HAL_HSP_IRQHandler(HSP_HandleTypeDef *hhsp);

/* Event IRQ Handlers and Callbacks *******************************************/
void HAL_HSP_EVT_IRQHandler(HSP_HandleTypeDef *hhsp);

void HAL_HSP_EVT_SPE_DirectCommandCpltCallback(HSP_HandleTypeDef *hhsp);
void HAL_HSP_EVT_SPE_TaskCpltCallback(HSP_HandleTypeDef *hhsp);
void HAL_HSP_EVT_SPE_FPUSaturationCallback(HSP_HandleTypeDef *hhsp);
void HAL_HSP_EVT_SPE_RunStateCallback(HSP_HandleTypeDef *hhsp, uint32_t state);
void HAL_HSP_EVT_STREAM_BufferEmptyCallback(HSP_HandleTypeDef *hhsp, uint32_t buffers_mask);
void HAL_HSP_EVT_STREAM_BufferFullCallback(HSP_HandleTypeDef *hhsp, uint32_t buffers_mask);
void HAL_HSP_EVT_TCU_TaskStartedCallback(HSP_HandleTypeDef *hhsp, uint32_t comparators_mask);
void HAL_HSP_EVT_TCU_TaskEndedCallback(HSP_HandleTypeDef *hhsp, uint32_t comparators_mask);
void HAL_HSP_EVT_TCU_TaskOverlapCallback(HSP_HandleTypeDef *hhsp);
void HAL_HSP_EVT_TSC_TimestampReadyCallback(HSP_HandleTypeDef *hhsp, uint32_t timestamp);

/* Error IRQ Handlers and Callbacks *******************************************/
void HAL_HSP_ERR_IRQHandler(HSP_HandleTypeDef *hhsp);
void HAL_HSP_ErrorCallback(HSP_HandleTypeDef *hhsp, uint32_t fw_error_code, uint32_t error_inf_mask);

/* Firmware Event IRQ Handlers and Callbacks **********************************/
void HAL_HSP_FWEVT_IRQHandler(HSP_HandleTypeDef *hhsp);
void HAL_HSP_FWEVT_ProcessingEventCallback(HSP_HandleTypeDef *hhsp, uint32_t events_mask);

#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions ************************************/
HAL_StatusTypeDef HAL_HSP_RegisterMspInitCallback(HSP_HandleTypeDef *hhsp, pHSP_CallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterMspDeInitCallback(HSP_HandleTypeDef *hhsp, pHSP_CallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterSPE_DirectCommandCpltCallback(HSP_HandleTypeDef *hhsp,
                                                                pHSP_CallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterSPE_TaskCpltCallback(HSP_HandleTypeDef *hhsp,
                                                       pHSP_CallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterSPE_FPUSaturationCallback(HSP_HandleTypeDef *hhsp,
                                                            pHSP_CallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterSPE_RunStateCallback(HSP_HandleTypeDef *hhsp,
                                                       pHSP_OneParamCallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterSTREAM_BufferEmptyCallback(HSP_HandleTypeDef *hhsp,
                                                             pHSP_OneParamCallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterSTREAM_BufferFullCallback(HSP_HandleTypeDef *hhsp,
                                                            pHSP_OneParamCallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterTCU_TaskOverlapCallback(HSP_HandleTypeDef *hhsp,
                                                          pHSP_CallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterTCU_TaskStartedCallback(HSP_HandleTypeDef *hhsp,
                                                          pHSP_OneParamCallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterTCU_TaskEndedCallback(HSP_HandleTypeDef *hhsp,
                                                        pHSP_OneParamCallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterTSC_TimestampReadyCallback(HSP_HandleTypeDef *hhsp,
                                                             pHSP_OneParamCallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterErrorCallback(HSP_HandleTypeDef *hhsp, pHSP_TwoParamsCallbackTypeDef p_callback);
HAL_StatusTypeDef HAL_HSP_RegisterFWEVT_ProcessingEventCallback(HSP_HandleTypeDef *hhsp,
                                                                pHSP_OneParamCallbackTypeDef p_callback);

#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup HSP_Exported_Functions_Group14  Peripheral State and Error functions
  * @{
  */
HAL_HSP_StateTypeDef HAL_HSP_GetState(const HSP_HandleTypeDef *hhsp);
uint32_t HAL_HSP_GetError(const HSP_HandleTypeDef *hhsp);
uint32_t HAL_HSP_GetBootErrorCode(const HSP_HandleTypeDef *hhsp);
uint32_t HAL_HSP_GetMsgBoxErrorCode(const HSP_HandleTypeDef *hhsp);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HSP1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U3xx_HAL_HSP_H */
